/*
#############################################################################################
# RocketLeague (1.0.10897.0) SDK
# Generated with the CodeRedGenerator v1.0.2
# ========================================================================================= #
# File: Core_parameters.hpp
# ========================================================================================= #
# Credits: TheFeckless, ItsBranK
# Links: www.github.com/CodeRedModding/CodeRed-Generator, www.twitter.com/ItsBranK
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x1)
#endif

/*
# ========================================================================================= #
# Parameters
# ========================================================================================= #
*/

// Function Core.Object.RSmoothInterpTo
// [0x00022003] 
struct UObject_execRSmoothInterpTo_Params
{
	struct FRotator                                    From;                                             		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FRotator                                    To;                                               		// 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	float                                              Lambda;                                           		// 0x0018 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              DeltaTime;                                        		// 0x001C (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FRotator                                    ReturnValue;                                      		// 0x0020 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.VSmoothInterpTo
// [0x00022003] 
struct UObject_execVSmoothInterpTo_Params
{
	struct FVector                                     From;                                             		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     To;                                               		// 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	float                                              Lambda;                                           		// 0x0018 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              DeltaTime;                                        		// 0x001C (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     ReturnValue;                                      		// 0x0020 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.FSmoothInterpTo
// [0x00022003] 
struct UObject_execFSmoothInterpTo_Params
{
	float                                              From;                                             		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              To;                                               		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Lambda;                                           		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              DeltaTime;                                        		// 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetSmoothInterpLerpValue
// [0x00022003] 
struct UObject_execGetSmoothInterpLerpValue_Params
{
	float                                              Lambda;                                           		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              DeltaTime;                                        		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetTypedOuter
// [0x00022401] 
struct UObject_execGetTypedOuter_Params
{
	class UClass*                                      ObjClass;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000D80] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm)
};

// Function Core.Object.MarkPendingKill
// [0x00020401] 
struct UObject_execMarkPendingKill_Params
{
};

// Function Core.Object.NotNone
// [0x00022003] 
struct UObject_execNotNone_Params
{
	class UObject*                                     O;                                                		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SwapArrayItems
// [0x80022001] 
struct UObject_execSwapArrayItems_Params
{
};

// Function Core.Object.Swap
// [0x80022001] 
struct UObject_execSwap_Params
{
};

// Function Core.Object.SumFloat
// [0x00022003] 
struct UObject_execSumFloat_Params
{
	float                                              Total;                                            		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Value;                                            		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SumInt
// [0x00022003] 
struct UObject_execSumInt_Params
{
	int32_t                                            Total;                                            		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            Value;                                            		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SortDescendingFloat
// [0x00022003] 
struct UObject_execSortDescendingFloat_Params
{
	float                                              A;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              B;                                                		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SortAscendingFloat
// [0x00022003] 
struct UObject_execSortAscendingFloat_Params
{
	float                                              A;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              B;                                                		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SortDescendingString
// [0x00022003] 
struct UObject_execSortDescendingString_Params
{
	class FString                                      A;                                                		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      B;                                                		// 0x0010 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	int32_t                                            ReturnValue;                                      		// 0x0020 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SortAscendingString
// [0x00022003] 
struct UObject_execSortAscendingString_Params
{
	class FString                                      A;                                                		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      B;                                                		// 0x0010 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	int32_t                                            ReturnValue;                                      		// 0x0020 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SortDescendingQWORD
// [0x00022003] 
struct UObject_execSortDescendingQWORD_Params
{
	uint64_t                                           A;                                                		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint64_t                                           B;                                                		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SortAscendingQWORD
// [0x00022003] 
struct UObject_execSortAscendingQWORD_Params
{
	uint64_t                                           A;                                                		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint64_t                                           B;                                                		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SortDescendingInt
// [0x00022003] 
struct UObject_execSortDescendingInt_Params
{
	int32_t                                            A;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            B;                                                		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SortAscendingInt
// [0x00022003] 
struct UObject_execSortAscendingInt_Params
{
	int32_t                                            A;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            B;                                                		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.PadString
// [0x00022003] 
struct UObject_execPadString_Params
{
	class FString                                      Str;                                              		// 0x0000 (0x0010) [0x0000000000400880] (CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink)
	int32_t                                            Characters;                                       		// 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class FString                                      ReturnValue;                                      		// 0x0018 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
	// int32_t                                            PadIdx;                                           		// 0x0028 (0x0004) [0x0000000000000000]               
};

// Function Core.Object.GetFrameCounter
// [0x00022401] 
struct UObject_execGetFrameCounter_Params
{
	uint64_t                                           ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetScaledAxisValue
// [0x00022401] 
struct UObject_execGetScaledAxisValue_Params
{
	float                                              Value;                                            		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Sensitivity;                                      		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              MaxSensitivity;                                   		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetSingleton
// [0x00022401] 
struct UObject_execGetSingleton_Params
{
	class UClass*                                      ObjClass;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000D80] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm)
};

// Function Core.Object.GetObjectProvider
// [0x00022401] 
struct UObject_execGetObjectProviderW_Params
{
	class UObjectProvider*                             ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000004000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_EditInline)
};

// Function Core.Object.IsAutomationTest
// [0x00022401] 
struct UObject_execIsAutomationTest_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.ToJson
// [0x00020401] 
struct UObject_execToJson_Params
{
	class FString                                      ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Core.Object.SetRooted
// [0x00020401] 
struct UObject_execSetRooted_Params
{
	uint32_t                                           bRooted : 1;                                      		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function Core.Object.ProfNodeEvent
// [0x00022401] 
struct UObject_execProfNodeEvent_Params
{
	class FString                                      EventName;                                        		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function Core.Object.ProfNodeSetDepthThreshold
// [0x00022401] 
struct UObject_execProfNodeSetDepthThreshold_Params
{
	int32_t                                            Depth;                                            		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Core.Object.ProfNodeSetTimeThresholdSeconds
// [0x00022401] 
struct UObject_execProfNodeSetTimeThresholdSeconds_Params
{
	float                                              Threshold;                                        		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Core.Object.ProfNodeStop
// [0x00026401] 
struct UObject_execProfNodeStop_Params
{
	int32_t                                            AssumedTimerIndex;                                		// 0x0000 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function Core.Object.ProfNodeStart
// [0x00022401] 
struct UObject_execProfNodeStart_Params
{
	class FString                                      TimerName;                                        		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	int32_t                                            ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.CreateGuidString
// [0x00822003] 
struct UObject_execCreateGuidString_Params
{
	class FString                                      ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
	// struct FGuid                                       NewGuid;                                          		// 0x0010 (0x0010) [0x0000000000000000]               
};

// Function Core.Object.GetStringFromGuid
// [0x00422401] 
struct UObject_execGetStringFromGuid_Params
{
	struct FGuid                                       InGuid;                                           		// 0x0000 (0x0010) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	class FString                                      ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Core.Object.GetGuidFromString
// [0x00422401] 
struct UObject_execGetGuidFromString_Params
{
	class FString                                      InGuidString;                                     		// 0x0000 (0x0010) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	struct FGuid                                       ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.CreateGuid
// [0x00022401] 
struct UObject_execCreateGuid_Params
{
	struct FGuid                                       ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.IsGuidValid
// [0x00422401] 
struct UObject_execIsGuidValid_Params
{
	struct FGuid                                       InGuid;                                           		// 0x0000 (0x0010) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.InvalidateGuid
// [0x00422401] 
struct UObject_execInvalidateGuid_Params
{
	struct FGuid                                       InGuid;                                           		// 0x0000 (0x0010) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function Core.Object.FindStructProperty
// [0x00020401] 
struct UObject_execFindStructProperty_Params
{
	class UClass*                                      PropertyClass;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FName                                       PropertyName;                                     		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FName                                       StructName;                                       		// 0x0010 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     ReturnValue;                                      		// 0x0018 (0x0008) [0x0000000000000D80] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm)
};

// Function Core.Object.FindProperty
// [0x00020401] 
struct UObject_execFindProperty_Params
{
	class UClass*                                      PropertyClass;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FName                                       PropertyName;                                     		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     ReturnValue;                                      		// 0x0010 (0x0008) [0x0000000000000D80] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm)
};

// Function Core.Object.DuplicateObject
// [0x00024401] 
struct UObject_execDuplicateObject_Params
{
	class UObject*                                     Template;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     ObjOuter;                                         		// 0x0008 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class UClass*                                      DestClass;                                        		// 0x0010 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class UObject*                                     ReturnValue;                                      		// 0x0018 (0x0008) [0x0000000000000D80] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm)
};

// Function Core.Object.RunningAverage
// [0x00020401] 
struct UObject_execRunningAverage_Params
{
	float                                              OldAverage;                                       		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              NewValue;                                         		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            NewCount;                                         		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetCurrentTime
// [0x00022401] 
struct UObject_execGetCurrentTimeW_Params
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetMaxLinearColorBrightness
// [0x00020501] 
struct UObject_execGetMaxLinearColorBrightness_Params
{
	struct FLinearColor                                C;                                                		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FLinearColor                                ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetMaxColorBrightness
// [0x00020103] 
struct UObject_execGetMaxColorBrightness_Params
{
	struct FColor                                      C;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FColor                                      ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.LABtoRGB
// [0x00022401] 
struct UObject_execLABtoRGB_Params
{
	struct FLinearColor                                C;                                                		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FLinearColor                                ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.RGBtoLAB
// [0x00022401] 
struct UObject_execRGBtoLAB_Params
{
	struct FLinearColor                                C;                                                		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FLinearColor                                ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.HSVtoRGB
// [0x00022401] 
struct UObject_execHSVtoRGB_Params
{
	struct FLinearColor                                C;                                                		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FLinearColor                                ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.RGBtoHSV
// [0x00022401] 
struct UObject_execRGBtoHSV_Params
{
	struct FLinearColor                                C;                                                		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FLinearColor                                ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.IntToLinearColor
// [0x00022103] 
struct UObject_execIntToLinearColor_Params
{
	int32_t                                            I;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FLinearColor                                ReturnValue;                                      		// 0x0004 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.IntToColor
// [0x00022401] 
struct UObject_execIntToColor_Params
{
	int32_t                                            I;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FColor                                      ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.LinearColorToInt
// [0x00022103] 
struct UObject_execLinearColorToInt_Params
{
	struct FLinearColor                                C;                                                		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.ColorToInt
// [0x00022401] 
struct UObject_execColorToInt_Params
{
	struct FColor                                      C;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SolveVelocityQuadratic
// [0x00420401] 
struct UObject_execSolveVelocityQuadratic_Params
{
	float                                              Distance;                                         		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Speed;                                            		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Accel;                                            		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Time;                                             		// 0x000C (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Sign
// [0x00020401] 
struct UObject_execSign_Params
{
	float                                              X;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.MakeVector2D
// [0x00822003] 
struct UObject_execMakeVector2D_Params
{
	float                                              X;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Y;                                                		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// struct FVector2D                                   V;                                                		// 0x0010 (0x0008) [0x0000000000000000]               
};

// Function Core.Object.VAbs
// [0x00022003] 
struct UObject_execVAbs_Params
{
	struct FVector                                     V;                                                		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     ReturnValue;                                      		// 0x000C (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.MakeVector
// [0x00822003] 
struct UObject_execMakeVector_Params
{
	float                                              X;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Y;                                                		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Z;                                                		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     ReturnValue;                                      		// 0x000C (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// struct FVector                                     V;                                                		// 0x0018 (0x000C) [0x0000000000000000]               
};

// Function Core.Object.FlattenVector
// [0x00020103] 
struct UObject_execFlattenVector_Params
{
	struct FVector                                     NormalToFlatten;                                  		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     PlaneNormal;                                      		// 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     ReturnValue;                                      		// 0x0018 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetRealArchetypeName
// [0x00020401] 
struct UObject_execGetRealArchetypeName_Params
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.FormatTime
// [0x00022003] 
struct UObject_execFormatTime_Params
{
	int32_t                                            Seconds;                                          		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class FString                                      ReturnValue;                                      		// 0x0008 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
	// int32_t                                            Mins;                                             		// 0x0018 (0x0004) [0x0000000000000000]               
	// class FString                                      NewTimeString;                                    		// 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function Core.Object.GetTextArchetype
// [0x00022401] 
struct UObject_execGetTextArchetype_Params
{
	class UClass*                                      ArchetypeClass;                                   		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class FString                                      Path;                                             		// 0x0008 (0x0010) [0x0000080000400082] (CPF_Const | CPF_Parm | CPF_NeedCtorLink)
	class UObject*                                     ReturnValue;                                      		// 0x0018 (0x0008) [0x0000000000000D80] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm)
};

// Function Core.Object.IsArchetype
// [0x00020401] 
struct UObject_execIsArchetype_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.UnsubscribeFromAllEvents
// [0x00020401] 
struct UObject_execUnsubscribeFromAllEvents_Params
{
};

// Function Core.Object.NewInstance
// [0x00024401] 
struct UObject_execNewInstance_Params
{
	class UObject*                                     ObjOuter;                                         		// 0x0000 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	struct FName                                       ObjName;                                          		// 0x0008 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class UObject*                                     ReturnValue;                                      		// 0x0010 (0x0008) [0x0000000000000D80] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm)
};

// Function Core.Object.PrintDebugInfo
// [0x00020100] 
struct UObject_execPrintDebugInfo_Params
{
	class UDebugDrawer*                                Drawer;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Core.Object.RotatorFromInt
// [0x00822003] 
struct UObject_execRotatorFromInt_Params
{
	int32_t                                            RotationPitchAndYaw;                              		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FRotator                                    ReturnValue;                                      		// 0x0004 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// struct FRotator                                    Rotation;                                         		// 0x0010 (0x000C) [0x0000000000000000]               
};

// Function Core.Object.RotatorToInt
// [0x00022003] 
struct UObject_execRotatorToInt_Params
{
	struct FRotator                                    Rotation;                                         		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetLanguage
// [0x00022401] 
struct UObject_execGetLanguage_Params
{
	class FString                                      ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Core.Object.GetRandomOptionSumFrequency
// [0x00420003] 
struct UObject_execGetRandomOptionSumFrequency_Params
{
	TArray<float>                                      FreqList;                                         		// 0x0000 (0x0010) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	int32_t                                            ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// float                                              FreqSum;                                          		// 0x0014 (0x0004) [0x0000000000000000]               
	// float                                              RandVal;                                          		// 0x0018 (0x0004) [0x0000000000000000]               
	// int32_t                                            Idx;                                              		// 0x001C (0x0004) [0x0000000000000000]               
};

// Function Core.Object.GetBuildChangelistNumber
// [0x00020401] 
struct UObject_execGetBuildChangelistNumber_Params
{
	int32_t                                            ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetEngineVersion
// [0x00020401] 
struct UObject_execGetEngineVersion_Params
{
	int32_t                                            ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetAppSeconds
// [0x00020401] 
struct UObject_execGetAppSeconds_Params
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetSystemTime
// [0x00420401] 
struct UObject_execGetSystemTime_Params
{
	int32_t                                            Year;                                             		// 0x0000 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            Month;                                            		// 0x0004 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            DayOfWeek;                                        		// 0x0008 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            Day;                                              		// 0x000C (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            Hour;                                             		// 0x0010 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            Min;                                              		// 0x0014 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            Sec;                                              		// 0x0018 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            MSec;                                             		// 0x001C (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function Core.Object.TimeStamp
// [0x00020401] 
struct UObject_execTimeStamp_Params
{
	class FString                                      ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Core.Object.TransformVectorByRotation
// [0x00024401] 
struct UObject_execTransformVectorByRotation_Params
{
	struct FRotator                                    SourceRotation;                                   		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     SourceVector;                                     		// 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bInverse : 1;                                     		// 0x0018 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	struct FVector                                     ReturnValue;                                      		// 0x001C (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetPackageName
// [0x00020003] 
struct UObject_execGetPackageName_Params
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// class UObject*                                     O;                                                		// 0x0008 (0x0008) [0x0000000000000000]               
};

// Function Core.Object.IsPendingKill
// [0x00020401] 
struct UObject_execIsPendingKill_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.RangeByteToFloatUnsigned
// [0x00020501] 
struct UObject_execRangeByteToFloatUnsigned_Params
{
	uint8_t                                            inputByte;                                        		// 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.RangeByteToFloatSigned
// [0x00020501] 
struct UObject_execRangeByteToFloatSigned_Params
{
	uint8_t                                            inputByte;                                        		// 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.FloatToRangeByteUnsigned
// [0x00020501] 
struct UObject_execFloatToRangeByteUnsigned_Params
{
	float                                              inputFloat;                                       		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint8_t                                            ReturnValue;                                      		// 0x0004 (0x0001) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.FloatToRangeByteSigned
// [0x00020501] 
struct UObject_execFloatToRangeByteSigned_Params
{
	float                                              inputFloat;                                       		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint8_t                                            ReturnValue;                                      		// 0x0004 (0x0001) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.UnwindHeading
// [0x00022103] 
struct UObject_execUnwindHeading_Params
{
	float                                              A;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.FindDeltaAngle
// [0x00022103] 
struct UObject_execFindDeltaAngle_Params
{
	float                                              A1;                                               		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              A2;                                               		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// float                                              delta;                                            		// 0x000C (0x0004) [0x0000000000000000]               
};

// Function Core.Object.GetHeadingAngle
// [0x00022103] 
struct UObject_execGetHeadingAngle_Params
{
	struct FVector                                     Dir;                                              		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// float                                              Angle;                                            		// 0x0010 (0x0004) [0x0000000000000000]               
};

// Function Core.Object.GetAngularDegreesFromRadians
// [0x00422103] 
struct UObject_execGetAngularDegreesFromRadians_Params
{
	struct FVector2D                                   OutFOV;                                           		// 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function Core.Object.GetAngularFromDotDist
// [0x00422401] 
struct UObject_execGetAngularFromDotDist_Params
{
	struct FVector2D                                   OutAngDist;                                       		// 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FVector2D                                   DotDist;                                          		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Core.Object.GetAngularDistance
// [0x00422401] 
struct UObject_execGetAngularDistance_Params
{
	struct FVector2D                                   OutAngularDist;                                   		// 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FVector                                     Direction;                                        		// 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AxisX;                                            		// 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AxisY;                                            		// 0x0020 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AxisZ;                                            		// 0x002C (0x000C) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0038 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetDotDistance
// [0x00422401] 
struct UObject_execGetDotDistance_Params
{
	struct FVector2D                                   OutDotDist;                                       		// 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FVector                                     Direction;                                        		// 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AxisX;                                            		// 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AxisY;                                            		// 0x0020 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AxisZ;                                            		// 0x002C (0x000C) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0038 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.LinePlaneIntersection
// [0x00C24003] 
struct UObject_execLinePlaneIntersection_Params
{
	struct FVector                                     LineStart;                                        		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     LineEnd;                                          		// 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     PlaneOrigin;                                      		// 0x0018 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     PlaneNormal;                                      		// 0x0024 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Out_Intersection;                                 		// 0x0030 (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              Out_T;                                            		// 0x003C (0x0004) [0x0000000000000190] (CPF_OptionalParm | CPF_Parm | CPF_OutParm)
	uint32_t                                           bCheckLineSegment : 1;                            		// 0x0040 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0044 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// struct FVector                                     RayDir;                                           		// 0x0048 (0x000C) [0x0000000000000000]               
};

// Function Core.Object.PointProjectToPlane
// [0x00022401] 
struct UObject_execPointProjectToPlane_Params
{
	struct FVector                                     Point;                                            		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     A;                                                		// 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     B;                                                		// 0x0018 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     C;                                                		// 0x0024 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     ReturnValue;                                      		// 0x0030 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.PointDistToPlane
// [0x00C24103] 
struct UObject_execPointDistToPlane_Params
{
	struct FVector                                     Point;                                            		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FRotator                                    Orientation;                                      		// 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Origin;                                           		// 0x0018 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     out_ClosestPoint;                                 		// 0x0024 (0x000C) [0x0000000000000190] (CPF_OptionalParm | CPF_Parm | CPF_OutParm)
	float                                              ReturnValue;                                      		// 0x0030 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// struct FVector                                     AxisX;                                            		// 0x0034 (0x000C) [0x0000000000000000]               
	// struct FVector                                     AxisY;                                            		// 0x0040 (0x000C) [0x0000000000000000]               
	// struct FVector                                     AxisZ;                                            		// 0x004C (0x000C) [0x0000000000000000]               
	// struct FVector                                     PointNoZ;                                         		// 0x0058 (0x000C) [0x0000000000000000]               
	// struct FVector                                     OriginNoZ;                                        		// 0x0064 (0x000C) [0x0000000000000000]               
	// float                                              fPointZ;                                          		// 0x0070 (0x0004) [0x0000000000000000]               
	// float                                              fProjDistToAxis;                                  		// 0x0074 (0x0004) [0x0000000000000000]               
};

// Function Core.Object.PointDistToSegment
// [0x00424401] 
struct UObject_execPointDistToSegment_Params
{
	struct FVector                                     Point;                                            		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     StartPoint;                                       		// 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     EndPoint;                                         		// 0x0018 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     OutClosestPoint;                                  		// 0x0024 (0x000C) [0x0000000000000190] (CPF_OptionalParm | CPF_Parm | CPF_OutParm)
	float                                              ReturnValue;                                      		// 0x0030 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.PointDistToLine
// [0x00426401] 
struct UObject_execPointDistToLine_Params
{
	struct FVector                                     Point;                                            		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Line;                                             		// 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Origin;                                           		// 0x0018 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     OutClosestPoint;                                  		// 0x0024 (0x000C) [0x0000000000000190] (CPF_OptionalParm | CPF_Parm | CPF_OutParm)
	float                                              ReturnValue;                                      		// 0x0030 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetPerObjectConfigObjects
// [0x00426405] 
struct UObject_execGetPerObjectConfigObjects_Params
{
	class UClass*                                      SearchClass;                                      		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     OutObject;                                        		// 0x0008 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	class UObject*                                     ObjectOuter;                                      		// 0x0010 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	int32_t                                            MaxResults;                                       		// 0x0018 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function Core.Object.GetPerObjectConfigSections
// [0x00426401] 
struct UObject_execGetPerObjectConfigSections_Params
{
	class UClass*                                      SearchClass;                                      		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	TArray<class FString>                              out_SectionNames;                                 		// 0x0008 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	class UObject*                                     ObjectOuter;                                      		// 0x0018 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	int32_t                                            MaxResults;                                       		// 0x0020 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0024 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.ImportJSON
// [0x00422401] 
struct UObject_execImportJSON_Params
{
	class FString                                      PropertyName;                                     		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      JSON;                                             		// 0x0010 (0x0010) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function Core.Object.StaticSaveConfig
// [0x00022401] 
struct UObject_execStaticSaveConfig_Params
{
};

// Function Core.Object.SaveConfig
// [0x00020401]  (iNative[536])
struct UObject_execSaveConfig_Params
{
};

// Function Core.Object.LoadSeekFreeObject
// [0x00022401] 
struct UObject_execLoadSeekFreeObject_Params
{
	class UClass*                                      ObjClass;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class FString                                      Path;                                             		// 0x0008 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UObject*                                     ReturnValue;                                      		// 0x0018 (0x0008) [0x0000000000000D80] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm)
};

// Function Core.Object.FindObject
// [0x00022401] 
struct UObject_execFindObject_Params
{
	class FString                                      ObjectName;                                       		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UClass*                                      ObjectClass;                                      		// 0x0010 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     ReturnValue;                                      		// 0x0018 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.DynamicLoadObject
// [0x00026401] 
struct UObject_execDynamicLoadObject_Params
{
	class FString                                      ObjectName;                                       		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UClass*                                      ObjectClass;                                      		// 0x0010 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           MayFail : 1;                                      		// 0x0018 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	class UObject*                                     ReturnValue;                                      		// 0x0020 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.EnumFromString
// [0x00022401] 
struct UObject_execEnumFromString_Params
{
	class UObject*                                     E;                                                		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FName                                       ValueName;                                        		// 0x0008 (0x0008) [0x0000000000000880] (CPF_Parm | CPF_CoerceParm)
