/*
#############################################################################################
# RocketLeague (1.0.10897.0) SDK
# Generated with the CodeRedGenerator v1.0.2
# ========================================================================================= #
# File: IpDrv_parameters.hpp
# ========================================================================================= #
# Credits: TheFeckless, ItsBranK
# Links: www.github.com/CodeRedModding/CodeRed-Generator, www.twitter.com/ItsBranK
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x1)
#endif

/*
# ========================================================================================= #
# Parameters
# ========================================================================================= #
*/

// Function IpDrv.AdHocDelegates.EventAdHocDestroyed
// [0x00120001] 
struct UAdHocDelegates_execEventAdHocDestroyed_Params
{
};

// Function IpDrv.AdHocDelegates.EventAdHocFinalized
// [0x00120001] 
struct UAdHocDelegates_execEventAdHocFinalized_Params
{
};

// Function IpDrv.AdHocDelegates.EventStationDisconnected
// [0x00120001] 
struct UAdHocDelegates_execEventStationDisconnected_Params
{
};

// Function IpDrv.AdHocDelegates.EventStationConnected
// [0x00120001] 
struct UAdHocDelegates_execEventStationConnected_Params
{
};

// Function IpDrv.AdHocDelegates.EventBecomeStation
// [0x00120001] 
struct UAdHocDelegates_execEventBecomeStation_Params
{
};

// Function IpDrv.AdHocDelegates.EventAccessPointCreated
// [0x00120001] 
struct UAdHocDelegates_execEventAccessPointCreated_Params
{
};

// Function IpDrv.AdHocDelegates.EventAdHocInitialized
// [0x00120001] 
struct UAdHocDelegates_execEventAdHocInitialized_Params
{
};

// Function IpDrv.AdHocDelegates.EventAdHocError
// [0x00120001] 
struct UAdHocDelegates_execEventAdHocError_Params
{
	class UError*                                      Error;                                            		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function IpDrv.AdHocDelegates.EventAdHocOnNetworkChanged
// [0x00120001] 
struct UAdHocDelegates_execEventAdHocOnNetworkChanged_Params
{
	TArray<struct FAdHocAccessPointInfo>               Ahapis;                                           		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function IpDrv.OnlineSubsystemCommonImpl.GetRegisteredPlayers
// [0x00420002] 
struct UOnlineSubsystemCommonImpl_execGetRegisteredPlayers_Params
{
	struct FName                                       SessionName;                                      		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	TArray<struct FUniqueNetId>                        OutRegisteredPlayers;                             		// 0x0008 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	// int32_t                                            Idx;                                              		// 0x0018 (0x0004) [0x0000000000000000]               
	// int32_t                                            PlayerIdx;                                        		// 0x001C (0x0004) [0x0000000000000000]               
};

// Function IpDrv.OnlineSubsystemCommonImpl.IsPlayerInSession
// [0x00020400] 
struct UOnlineSubsystemCommonImpl_execIsPlayerInSession_Params
{
	struct FName                                       SessionName;                                      		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FUniqueNetId                                PlayerID;                                         		// 0x0008 (0x0048) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0050 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.OnlineSubsystemCommonImpl.GetPlayerNicknameFromIndex
// [0x00020800] 
struct UOnlineSubsystemCommonImpl_eventGetPlayerNicknameFromIndex_Params
{
	int32_t                                            UserIndex;                                        		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class FString                                      ReturnValue;                                      		// 0x0008 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function IpDrv.OnlineSubsystemCommonImpl.OnPlayerCountryRetrieved
// [0x00120000] 
struct UOnlineSubsystemCommonImpl_execOnPlayerCountryRetrieved_Params
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0000 (0x0048) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      Country;                                          		// 0x0048 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function IpDrv.OnlineSubsystemCommonImpl.OnSanitizeStringComplete
// [0x00120001] 
struct UOnlineSubsystemCommonImpl_execOnSanitizeStringComplete_Params
{
	struct FWordFilterResult                           Result;                                           		// 0x0000 (0x0038) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function IpDrv.AvatarDownloadComponent.TriggerAvatarCallbacks
// [0x00040003] 
struct UAvatarDownloadComponent_execTriggerAvatarCallbacks_Params
{
	class UAvatarDownload*                             Avatar;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function IpDrv.AvatarDownloadComponent.HandleOnlineImageDownloaded
// [0x00040003] 
struct UAvatarDownloadComponent_execHandleOnlineImageDownloaded_Params
{
	struct FOnlineImageDownload                        ImageInfo;                                        		// 0x0000 (0x0040) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	// TArray<class UAvatarDownload*>                     AvatarsWaitingOnThisImage;                        		// 0x0040 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	// class UAvatarDownload*                             Avatar;                                           		// 0x0050 (0x0008) [0x0000000000000000]               
};

// Function IpDrv.AvatarDownloadComponent.GetAvatar
// [0x00840003] 
struct UAvatarDownloadComponent_execGetAvatar_Params
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0000 (0x0048) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	uint8_t                                            Size;                                             		// 0x0048 (0x0001) [0x0000000000000080] (CPF_Parm)    
	class UAvatarDownload*                             ReturnValue;                                      		// 0x0050 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// struct FAvatarKey                                  Key;                                              		// 0x0058 (0x0050) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function IpDrv.AvatarDownloadComponent.ClearPendingDownloads
// [0x00020003] 
struct UAvatarDownloadComponent_execClearPendingDownloads_Params
{
};

// Function IpDrv.AvatarDownloadComponent.CleanupAvatars
// [0x00020003] 
struct UAvatarDownloadComponent_execCleanupAvatars_Params
{
	// class UAvatarDownload*                             Avatar;                                           		// 0x0000 (0x0008) [0x0000000000000000]               
};

// Function IpDrv.AvatarDownloadComponent.DownloadAvatar
// [0x00020003] 
struct UAvatarDownloadComponent_execDownloadAvatar_Params
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0000 (0x0048) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	uint8_t                                            Size;                                             		// 0x0048 (0x0001) [0x0000000000000080] (CPF_Parm)    
	class FString                                      URL;                                              		// 0x0050 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	// TArray<class FString>                              URLs;                                             		// 0x0060 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	// class UAvatarDownload*                             Avatar;                                           		// 0x0070 (0x0008) [0x0000000000000000]               
	// class UTexture*                                    DownloadedTexture;                                		// 0x0078 (0x0008) [0x0000000000000000]               
};

// Function IpDrv.AvatarDownloadComponent.StoreNewAvatars
// [0x00420401] 
struct UAvatarDownloadComponent_execStoreNewAvatars_Params
{
	TArray<struct FUniqueNetId>                        NewPlayerIDs;                                     		// 0x0000 (0x0010) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	uint8_t                                            Size;                                             		// 0x0010 (0x0001) [0x0000000000000080] (CPF_Parm)    
	struct FScriptDelegate                             ReadOnlineAvatarCompleteDelegate;                 		// 0x0018 (0x0018) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function IpDrv.AvatarDownloadComponent.ProcessOldRequests
// [0x00420401] 
struct UAvatarDownloadComponent_execProcessOldRequests_Params
{
	TArray<struct FUniqueNetId>                        InPlayerIDs;                                      		// 0x0000 (0x0010) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	uint8_t                                            SizeType;                                         		// 0x0010 (0x0001) [0x0000000000000080] (CPF_Parm)    
	struct FScriptDelegate                             ReadOnlineAvatarCompleteDelegate;                 		// 0x0018 (0x0018) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	TArray<struct FUniqueNetId>                        NewRequestIDs;                                    		// 0x0030 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function IpDrv.AvatarDownloadComponent.TryAddAvatarTextureCallback
// [0x00020401] 
struct UAvatarDownloadComponent_execTryAddAvatarTextureCallback_Params
{
	struct FUniqueNetId                                PlayerNetId;                                      		// 0x0000 (0x0048) [0x0000000000400082] (CPF_Const | CPF_Parm | CPF_NeedCtorLink)
	uint8_t                                            Size;                                             		// 0x0048 (0x0001) [0x0000000000000080] (CPF_Parm)    
	struct FScriptDelegate                             ReadOnlineAvatarCompleteDelegate;                 		// 0x0050 (0x0018) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0068 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.AvatarDownloadMap.ContainsImage
// [0x00020401] 
struct UAvatarDownloadMap_execContainsImage_Params
{
	class FString                                      Key;                                              		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.AvatarDownloadMap.ContainsAvatar
// [0x00420401] 
struct UAvatarDownloadMap_execContainsAvatar_Params
{
	struct FAvatarKey                                  Key;                                              		// 0x0000 (0x0050) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0050 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.AvatarDownloadMap.OnAvatarReceivedImage
// [0x00020401] 
struct UAvatarDownloadMap_execOnAvatarReceivedImage_Params
{
	class UAvatarDownload*                             Avatar;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function IpDrv.AvatarDownloadMap.RemoveImage
// [0x00020401] 
struct UAvatarDownloadMap_execRemoveImage_Params
{
	class FString                                      Key;                                              		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function IpDrv.AvatarDownloadMap.RemoveAvatar
// [0x00420401] 
struct UAvatarDownloadMap_execRemoveAvatar_Params
{
	struct FAvatarKey                                  Key;                                              		// 0x0000 (0x0050) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function IpDrv.AvatarDownloadMap.RemoveAllNetIDs
// [0x00420401] 
struct UAvatarDownloadMap_execRemoveAllNetIDs_Params
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0000 (0x0048) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function IpDrv.AvatarDownloadMap.ClearAvatarsPendingImages
// [0x00020401] 
struct UAvatarDownloadMap_execClearAvatarsPendingImages_Params
{
};

// Function IpDrv.AvatarDownloadMap.ClearImages
// [0x00020401] 
struct UAvatarDownloadMap_execClearImages_Params
{
};

// Function IpDrv.AvatarDownloadMap.ClearAvatars
// [0x00020401] 
struct UAvatarDownloadMap_execClearAvatars_Params
{
};

// Function IpDrv.AvatarDownloadMap.Clear
// [0x00020401] 
struct UAvatarDownloadMap_execClear_Params
{
};

// Function IpDrv.AvatarDownloadMap.TryGetImage
// [0x00420401] 
struct UAvatarDownloadMap_execTryGetImage_Params
{
	class FString                                      Key;                                              		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UTexture*                                    OutValue;                                         		// 0x0010 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.AvatarDownloadMap.TryGetAvatar
// [0x00420401] 
struct UAvatarDownloadMap_execTryGetAvatar_Params
{
	struct FAvatarKey                                  Key;                                              		// 0x0000 (0x0050) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	class UAvatarDownload*                             OutValue;                                         		// 0x0050 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0058 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.AvatarDownloadMap.GetAvatarsPendingImage
// [0x00420401] 
struct UAvatarDownloadMap_execGetAvatarsPendingImage_Params
{
	class FString                                      Key;                                              		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	TArray<class UAvatarDownload*>                     OutAvatars;                                       		// 0x0010 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function IpDrv.AvatarDownloadMap.GetImage
// [0x00020401] 
struct UAvatarDownloadMap_execGetImage_Params
{
	class FString                                      Key;                                              		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UTexture*                                    ReturnValue;                                      		// 0x0010 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.AvatarDownloadMap.GetAvatar
// [0x00420401] 
struct UAvatarDownloadMap_execGetAvatar_Params
{
	struct FAvatarKey                                  Key;                                              		// 0x0000 (0x0050) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	class UAvatarDownload*                             ReturnValue;                                      		// 0x0050 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.AvatarDownloadMap.AddAvatarPendingImage
// [0x00020401] 
struct UAvatarDownloadMap_execAddAvatarPendingImage_Params
{
	class UAvatarDownload*                             Avatar;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function IpDrv.AvatarDownloadMap.SetImage
// [0x00020401] 
struct UAvatarDownloadMap_execSetImage_Params
{
	class FString                                      URL;                                              		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UTexture*                                    Value;                                            		// 0x0010 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function IpDrv.AvatarDownloadMap.SetAvatar
// [0x00020401] 
struct UAvatarDownloadMap_execSetAvatar_Params
{
	class UAvatarDownload*                             Value;                                            		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function IpDrv.AvatarDownloadMap.CountAvatars
// [0x00020401] 
struct UAvatarDownloadMap_execCountAvatars_Params
{
	int32_t                                            ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.AvatarDownloadMap.AllValues
// [0x00424405] 
struct UAvatarDownloadMap_execAllValues_Params
{
	class UAvatarDownload*                             OutAvatar;                                        		// 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            StartIndex;                                       		// 0x0008 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	int32_t                                            MaxValues;                                        		// 0x000C (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function IpDrv.HttpRequestCurl.ProcessRequest
// [0x400020400] 
struct UHttpRequestCurl_execProcessRequest_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.HttpRequestCurl.SetHeader
// [0x400020400] 
struct UHttpRequestCurl_execSetHeader_Params
{
	class FString                                      HeaderName;                                       		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      HeaderValue;                                      		// 0x0010 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UHttpRequestInterface*                       ReturnValue;                                      		// 0x0020 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.HttpRequestCurl.SetContentAsString
// [0x400020400] 
struct UHttpRequestCurl_execSetContentAsString_Params
{
	class FString                                      ContentString;                                    		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UHttpRequestInterface*                       ReturnValue;                                      		// 0x0010 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.HttpRequestCurl.SetContent
// [0x400420400] 
struct UHttpRequestCurl_execSetContent_Params
{
	TArray<uint8_t>                                    ContentPayload;                                   		// 0x0000 (0x0010) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	class UHttpRequestInterface*                       ReturnValue;                                      		// 0x0010 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.HttpRequestCurl.SetURL
// [0x400020400] 
struct UHttpRequestCurl_execSetURL_Params
{
	class FString                                      URL;                                              		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UHttpRequestInterface*                       ReturnValue;                                      		// 0x0010 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.HttpRequestCurl.SetVerb
// [0x400020400] 
struct UHttpRequestCurl_execSetVerb_Params
{
	class FString                                      Verb;                                             		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UHttpRequestInterface*                       ReturnValue;                                      		// 0x0010 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.HttpRequestCurl.GetVerb
// [0x400020400] 
struct UHttpRequestCurl_execGetVerb_Params
{
	class FString                                      ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function IpDrv.HttpRequestCurl.GetContent
// [0x400420400] 
struct UHttpRequestCurl_execGetContent_Params
{
	TArray<uint8_t>                                    Content;                                          		// 0x0000 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function IpDrv.HttpRequestCurl.GetURL
// [0x400020400] 
struct UHttpRequestCurl_execGetURL_Params
{
	class FString                                      ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function IpDrv.HttpRequestCurl.GetContentLength
// [0x400020400] 
struct UHttpRequestCurl_execGetContentLength_Params
{
	int32_t                                            ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.HttpRequestCurl.GetContentType
// [0x400020400] 
struct UHttpRequestCurl_execGetContentType_Params
{
	class FString                                      ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function IpDrv.HttpRequestCurl.GetURLParameter
// [0x400020400] 
struct UHttpRequestCurl_execGetURLParameter_Params
{
	class FString                                      ParameterName;                                    		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function IpDrv.HttpRequestCurl.GetHeaders
// [0x400020400] 
struct UHttpRequestCurl_execGetHeaders_Params
{
	TArray<class FString>                              ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function IpDrv.HttpRequestCurl.GetHeader
// [0x400020400] 
struct UHttpRequestCurl_execGetHeader_Params
{
	class FString                                      HeaderName;                                       		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function IpDrv.HttpResponseCurl.GetResponseCode
// [0x400020400] 
struct UHttpResponseCurl_execGetResponseCode_Params
{
	int32_t                                            ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.HttpResponseCurl.GetContentAsString
// [0x400020400] 
struct UHttpResponseCurl_execGetContentAsString_Params
{
	class FString                                      ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function IpDrv.HttpResponseCurl.GetContent
// [0x400420400] 
struct UHttpResponseCurl_execGetContent_Params
{
	TArray<uint8_t>                                    Content;                                          		// 0x0000 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function IpDrv.HttpResponseCurl.GetURL
// [0x400020400] 
struct UHttpResponseCurl_execGetURL_Params
{
	class FString                                      ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function IpDrv.HttpResponseCurl.GetContentLength
// [0x400020400] 
struct UHttpResponseCurl_execGetContentLength_Params
{
	int32_t                                            ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.HttpResponseCurl.GetContentType
// [0x400020400] 
struct UHttpResponseCurl_execGetContentType_Params
{
	class FString                                      ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function IpDrv.HttpResponseCurl.GetURLParameter
// [0x400020400] 
struct UHttpResponseCurl_execGetURLParameter_Params
{
	class FString                                      ParameterName;                                    		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function IpDrv.HttpResponseCurl.GetHeaders
// [0x400020400] 
struct UHttpResponseCurl_execGetHeaders_Params
{
	TArray<class FString>                              ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function IpDrv.HttpResponseCurl.GetHeader
// [0x400020400] 
struct UHttpResponseCurl_execGetHeader_Params
{
	class FString                                      HeaderName;                                       		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function IpDrv.ImageDecoder.RequestDecodeImage
// [0x00420401] 
struct UImageDecoder_execRequestDecodeImage_Params
{
	class FString                                      RequestURL;                                       		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	uint8_t                                            ImageType;                                        		// 0x0010 (0x0001) [0x0000000000000080] (CPF_Parm)    
	struct FScriptDelegate                             FinishedCallback;                                 		// 0x0018 (0x0018) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	TArray<uint8_t>                                    ImageData;                                        		// 0x0030 (0x0010) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function IpDrv.ImageDecoder.ImageDecodedDelegate
// [0x00120001] 
struct UImageDecoder_execImageDecodedDelegate_Params
{
	class FString                                      RequestURL;                                       		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	struct FImageLayout                                Image;                                            		// 0x0010 (0x0018) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function IpDrv.InternetLink.ResolveFailed
// [0x00020801] 
struct AInternetLink_eventResolveFailed_Params
{
};

// Function IpDrv.InternetLink.Resolved
// [0x00020801] 
struct AInternetLink_eventResolved_Params
{
	struct FIpAddr                                     Addr;                                             		// 0x0000 (0x0014) [0x0000000000000080] (CPF_Parm)    
};

// Function IpDrv.InternetLink.GetLocalIP
// [0x00420401] 
struct AInternetLink_execGetLocalIP_Params
{
	struct FIpAddr                                     Arg;                                              		// 0x0000 (0x0014) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function IpDrv.InternetLink.StringToIpAddr
// [0x00420401] 
struct AInternetLink_execStringToIpAddr_Params
{
	class FString                                      Str;                                              		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	struct FIpAddr                                     Addr;                                             		// 0x0010 (0x0014) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0024 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.InternetLink.IpAddrToString
// [0x00020401] 
struct AInternetLink_execIpAddrToString_Params
{
	struct FIpAddr                                     Arg;                                              		// 0x0000 (0x0014) [0x0000000000000080] (CPF_Parm)    
	class FString                                      ReturnValue;                                      		// 0x0018 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function IpDrv.InternetLink.GetLastError
// [0x00020401] 
struct AInternetLink_execGetLastError_Params
{
	int32_t                                            ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.InternetLink.Resolve
// [0x00020401] 
struct AInternetLink_execResolve_Params
{
	class FString                                      Domain;                                           		// 0x0000 (0x0010) [0x0000000000400880] (CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink)
};

// Function IpDrv.InternetLink.ParseURL
// [0x00420401] 
struct AInternetLink_execParseURL_Params
{
	class FString                                      URL;                                              		// 0x0000 (0x0010) [0x0000000000400880] (CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink)
	class FString                                      Addr;                                             		// 0x0010 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	int32_t                                            PortNum;                                          		// 0x0020 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	class FString                                      LevelName;                                        		// 0x0028 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	class FString                                      EntryName;                                        		// 0x0038 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0048 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.InternetLink.IsDataPending
// [0x00020401] 
struct AInternetLink_execIsDataPending_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.TcpLink.ReceivedBinary
// [0x00020801] 
struct ATcpLink_eventReceivedBinary_Params
{
	int32_t                                            Count;                                            		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint8_t                                            B[0xFF];                                          		// 0x0004 (0x00FF) [0x0000000000000080] (CPF_Parm)    
};

// Function IpDrv.TcpLink.ReceivedLine
// [0x00020800] 
struct ATcpLink_eventReceivedLine_Params
{
	class FString                                      Line;                                             		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function IpDrv.TcpLink.ReceivedText
// [0x00020800] 
struct ATcpLink_eventReceivedText_Params
{
	class FString                                      Text;                                             		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function IpDrv.TcpLink.Closed
// [0x00020800] 
struct ATcpLink_eventClosed_Params
{
};

// Function IpDrv.TcpLink.Opened
// [0x00020801] 
struct ATcpLink_eventOpened_Params
{
};

// Function IpDrv.TcpLink.Accepted
// [0x00020800] 
struct ATcpLink_eventAccepted_Params
{
};

// Function IpDrv.TcpLink.ReadBinary
// [0x00420401] 
struct ATcpLink_execReadBinary_Params
{
	int32_t                                            Count;                                            		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint8_t                                            B[0xFF];                                          		// 0x0004 (0x00FF) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            ReturnValue;                                      		// 0x0104 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.TcpLink.ReadText
// [0x00420401] 
struct ATcpLink_execReadText_Params
{
	class FString                                      Str;                                              		// 0x0000 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	int32_t                                            ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.TcpLink.SendBinary
// [0x00020401] 
struct ATcpLink_execSendBinary_Params
{
	int32_t                                            Count;                                            		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint8_t                                            B[0xFF];                                          		// 0x0004 (0x00FF) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            ReturnValue;                                      		// 0x0104 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.TcpLink.SendText
// [0x00020401] 
struct ATcpLink_execSendText_Params
{
	class FString                                      Str;                                              		// 0x0000 (0x0010) [0x0000000000400880] (CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink)
	int32_t                                            ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.TcpLink.IsConnected
// [0x00020401] 
struct ATcpLink_execIsConnected_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.TcpLink.Close
// [0x00020401] 
struct ATcpLink_execClose_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.TcpLink.Open
// [0x00020401] 
struct ATcpLink_execOpen_Params
{
	struct FIpAddr                                     Addr;                                             		// 0x0000 (0x0014) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.TcpLink.Listen
// [0x00020401] 
struct ATcpLink_execListen_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.TcpLink.BindPort
// [0x00024401] 
struct ATcpLink_execBindPort_Params
{
	int32_t                                            PortNum;                                          		// 0x0000 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           bUseNextAvailable : 1;                            		// 0x0004 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	int32_t                                            ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.McpServiceBase.GetUserAuthURL
// [0x00020003] 
struct UMcpServiceBase_execGetUserAuthURL_Params
{
	class FString                                      McpId;                                            		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
	// class FString                                      AuthTicket;                                       		// 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function IpDrv.McpServiceBase.GetAppAccessURL
// [0x00020003] 
struct UMcpServiceBase_execGetAppAccessURL_Params
{
	class FString                                      ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function IpDrv.McpServiceBase.GetBaseURL
// [0x00020003] 
struct UMcpServiceBase_execGetBaseURL_Params
{
	class FString                                      ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function IpDrv.McpServiceBase.Init
// [0x00020802] 
struct UMcpServiceBase_eventInit_Params
{
	// class UClass*                                      McpConfigClass;                                   		// 0x0000 (0x0008) [0x0000000000000000]               
};

// Function IpDrv.OnlineEventsInterfaceMcp.UploadMatchmakingStats
// [0x00020401] 
struct UOnlineEventsInterfaceMcp_execUploadMatchmakingStats_Params
{
	struct FUniqueNetId                                UniqueId;                                         		// 0x0000 (0x0048) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UOnlineMatchmakingStats*                     MMStats;                                          		// 0x0048 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0050 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.OnlineEventsInterfaceMcp.UpdatePlaylistPopulation
// [0x00020401] 
struct UOnlineEventsInterfaceMcp_execUpdatePlaylistPopulation_Params
{
	int32_t                                            PlaylistId;                                       		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            NumPlayers;                                       		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.OnlineEventsInterfaceMcp.UploadGameplayEventsData
// [0x00420401] 
struct UOnlineEventsInterfaceMcp_execUploadGameplayEventsData_Params
{
	struct FUniqueNetId                                UniqueId;                                         		// 0x0000 (0x0048) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	TArray<uint8_t>                                    Payload;                                          		// 0x0048 (0x0010) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0058 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.OnlineEventsInterfaceMcp.UploadPlayerData
// [0x00020401] 
struct UOnlineEventsInterfaceMcp_execUploadPlayerData_Params
{
	struct FUniqueNetId                                UniqueId;                                         		// 0x0000 (0x0048) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      PlayerNick;                                       		// 0x0048 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UOnlineProfileSettings*                      ProfileSettings;                                  		// 0x0058 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UOnlinePlayerStorage*                        PlayerStorage;                                    		// 0x0060 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0068 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.OnlineNewsInterfaceMcp.GetNews
// [0x00020003] 
struct UOnlineNewsInterfaceMcp_execGetNews_Params
{
	uint8_t                                            LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	uint8_t                                            NewsType;                                         		// 0x0001 (0x0001) [0x0000000000000080] (CPF_Parm)    
	class FString                                      ReturnValue;                                      		// 0x0008 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
	// int32_t                                            NewsIndex;                                        		// 0x0018 (0x0004) [0x0000000000000000]               
};

// Function IpDrv.OnlineNewsInterfaceMcp.ClearReadNewsCompletedDelegate
// [0x00020003] 
struct UOnlineNewsInterfaceMcp_execClearReadNewsCompletedDelegate_Params
{
	struct FScriptDelegate                             ReadGameNewsDelegate;                             		// 0x0000 (0x0018) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	// int32_t                                            RemoveIndex;                                      		// 0x0018 (0x0004) [0x0000000000000000]               
};

// Function IpDrv.OnlineNewsInterfaceMcp.AddReadNewsCompletedDelegate
// [0x00020003] 
struct UOnlineNewsInterfaceMcp_execAddReadNewsCompletedDelegate_Params
{
	struct FScriptDelegate                             ReadNewsDelegate;                                 		// 0x0000 (0x0018) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function IpDrv.OnlineNewsInterfaceMcp.OnReadNewsCompleted
// [0x00120001] 
struct UOnlineNewsInterfaceMcp_execOnReadNewsCompleted_Params
{
	uint32_t                                           bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint8_t                                            NewsType;                                         		// 0x0004 (0x0001) [0x0000000000000080] (CPF_Parm)    
};

// Function IpDrv.OnlineNewsInterfaceMcp.ReadNews
// [0x00020401] 
struct UOnlineNewsInterfaceMcp_execReadNews_Params
{
	uint8_t                                            LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	uint8_t                                            NewsType;                                         		// 0x0001 (0x0001) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.OnlineTitleFileDownloadBase.GetUrlForFile
// [0x00020400] 
struct UOnlineTitleFileDownloadBase_execGetUrlForFile_Params
{
	class FString                                      Filename;                                         		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function IpDrv.OnlineTitleFileDownloadBase.ClearRequestTitleFileListCompleteDelegate
// [0x00020003] 
struct UOnlineTitleFileDownloadBase_execClearRequestTitleFileListCompleteDelegate_Params
{
	struct FScriptDelegate                             RequestTitleFileListDelegate;                     		// 0x0000 (0x0018) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	// int32_t                                            RemoveIndex;                                      		// 0x0018 (0x0004) [0x0000000000000000]               
};

// Function IpDrv.OnlineTitleFileDownloadBase.AddRequestTitleFileListCompleteDelegate
// [0x00020003] 
struct UOnlineTitleFileDownloadBase_execAddRequestTitleFileListCompleteDelegate_Params
{
	struct FScriptDelegate                             RequestTitleFileListDelegate;                     		// 0x0000 (0x0018) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function IpDrv.OnlineTitleFileDownloadBase.OnRequestTitleFileListComplete
// [0x00120001] 
struct UOnlineTitleFileDownloadBase_execOnRequestTitleFileListComplete_Params
{
	uint32_t                                           bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	TArray<class FString>                              ResultStr;                                        		// 0x0008 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function IpDrv.OnlineTitleFileDownloadBase.RequestTitleFileList
// [0x00020000] 
struct UOnlineTitleFileDownloadBase_execRequestTitleFileList_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.OnlineTitleFileDownloadBase.ClearDownloadedFile
// [0x00020000] 
struct UOnlineTitleFileDownloadBase_execClearDownloadedFile_Params
{
	class FString                                      Filename;                                         		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.OnlineTitleFileDownloadBase.ClearDownloadedFiles
// [0x00020000] 
struct UOnlineTitleFileDownloadBase_execClearDownloadedFiles_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.OnlineTitleFileDownloadBase.GetTitleFileState
// [0x00020000] 
struct UOnlineTitleFileDownloadBase_execGetTitleFileState_Params
{
	class FString                                      Filename;                                         		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	EOnlineEnumerationReadState                        ReturnValue;                                      		// 0x0010 (0x0001) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.OnlineTitleFileDownloadBase.GetTitleFileContents
// [0x00420000] 
struct UOnlineTitleFileDownloadBase_execGetTitleFileContents_Params
{
	class FString                                      Filename;                                         		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	TArray<uint8_t>                                    FileContents;                                     		// 0x0010 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0020 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.OnlineTitleFileDownloadBase.ClearReadTitleFileCompleteDelegate
// [0x00020003] 
struct UOnlineTitleFileDownloadBase_execClearReadTitleFileCompleteDelegate_Params
{
	struct FScriptDelegate                             ReadTitleFileCompleteDelegate;                    		// 0x0000 (0x0018) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	// int32_t                                            RemoveIndex;                                      		// 0x0018 (0x0004) [0x0000000000000000]               
};

// Function IpDrv.OnlineTitleFileDownloadBase.AddReadTitleFileCompleteDelegate
// [0x00020003] 
struct UOnlineTitleFileDownloadBase_execAddReadTitleFileCompleteDelegate_Params
{
	struct FScriptDelegate                             ReadTitleFileCompleteDelegate;                    		// 0x0000 (0x0018) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function IpDrv.OnlineTitleFileDownloadBase.ReadTitleFile
// [0x00024000] 
struct UOnlineTitleFileDownloadBase_execReadTitleFile_Params
{
	class FString                                      FileToRead;                                       		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	uint8_t                                            FileType;                                         		// 0x0010 (0x0001) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.OnlineTitleFileDownloadBase.OnReadTitleFileComplete
// [0x00120001] 
struct UOnlineTitleFileDownloadBase_execOnReadTitleFileComplete_Params
{
	uint32_t                                           bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	class FString                                      Filename;                                         		// 0x0008 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function IpDrv.OnlineTitleFileDownloadMcp.ClearDownloadedFile
// [0x400020400] 
struct UOnlineTitleFileDownloadMcp_execClearDownloadedFile_Params
{
	class FString                                      Filename;                                         		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.OnlineTitleFileDownloadMcp.ClearDownloadedFiles
// [0x400020400] 
struct UOnlineTitleFileDownloadMcp_execClearDownloadedFiles_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.OnlineTitleFileDownloadMcp.GetTitleFileState
// [0x400020002] 
struct UOnlineTitleFileDownloadMcp_execGetTitleFileState_Params
{
	class FString                                      Filename;                                         		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	EOnlineEnumerationReadState                        ReturnValue;                                      		// 0x0010 (0x0001) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// int32_t                                            FileIndex;                                        		// 0x0014 (0x0004) [0x0000000000000000]               
};

// Function IpDrv.OnlineTitleFileDownloadMcp.GetTitleFileContents
// [0x400420400] 
struct UOnlineTitleFileDownloadMcp_execGetTitleFileContents_Params
{
	class FString                                      Filename;                                         		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	TArray<uint8_t>                                    FileContents;                                     		// 0x0010 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0020 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.OnlineTitleFileDownloadMcp.ReadTitleFile
// [0x400024400] 
struct UOnlineTitleFileDownloadMcp_execReadTitleFile_Params
{
	class FString                                      FileToRead;                                       		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	uint8_t                                            FileType;                                         		// 0x0010 (0x0001) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.OnlineTitleFileDownloadWeb.GetUrlForFile
// [0x400020002] 
struct UOnlineTitleFileDownloadWeb_execGetUrlForFile_Params
{
	class FString                                      Filename;                                         		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
	// class FString                                      URL;                                              		// 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function IpDrv.OnlineTitleFileDownloadWeb.OnFileListReceived
// [0x00020003] 
struct UOnlineTitleFileDownloadWeb_execOnFileListReceived_Params
{
	class UHttpRequestInterface*                       Request;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UHttpResponseInterface*                      Response;                                         		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bDidSucceed : 1;                                  		// 0x0010 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	// int32_t                                            Index;                                            		// 0x0014 (0x0004) [0x0000000000000000]               
	// struct FScriptDelegate                             RequestTitleFileListDelegate;                     		// 0x0018 (0x0018) [0x0000000000400000] (CPF_NeedCtorLink)
	// TArray<class FString>                              ResponseArr;                                      		// 0x0030 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	// uint32_t                                           bSuccess : 1;                                     		// 0x0040 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.OnlineTitleFileDownloadWeb.RequestTitleFileList
// [0x400020002] 
struct UOnlineTitleFileDownloadWeb_execRequestTitleFileList_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// class UHttpRequestInterface*                       HTTPRequest;                                      		// 0x0008 (0x0008) [0x0000000000000000]               
	// class FString                                      URL;                                              		// 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	// uint32_t                                           Success : 1;                                      		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function IpDrv.OnlineTitleFileDownloadWeb.ClearDownloadedFile
// [0x400020400] 
struct UOnlineTitleFileDownloadWeb_execClearDownloadedFile_Params
{
	class FString                                      Filename;                                         		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.OnlineTitleFileDownloadWeb.ClearDownloadedFiles
// [0x400020400] 
struct UOnlineTitleFileDownloadWeb_execClearDownloadedFiles_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function IpDrv.OnlineTitleFileDownloadWeb.GetTitleFileState
// [0x400020002] 
