/*
#############################################################################################
# RocketLeague (1.0.10897.0) SDK
# Generated with the CodeRedGenerator v1.0.2
# ========================================================================================= #
# File: ProjectX_structs.hpp
# ========================================================================================= #
# Credits: TheFeckless, ItsBranK
# Links: www.github.com/CodeRedModding/CodeRed-Generator, www.twitter.com/ItsBranK
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x1)
#endif

/*
# ========================================================================================= #
# Structs
# ========================================================================================= #
*/

// ScriptStruct ProjectX._Types_X.RenderProfile
// 0x0028
struct FRenderProfile
{
	float                                              GameThreadTime;                                // 0x0000 (0x0004) [0x0000000000000000]               
	float                                              RenderThreadTime;                              // 0x0004 (0x0004) [0x0000000000000000]               
	float                                              GPUTime;                                       // 0x0008 (0x0004) [0x0000000000000000]               
	float                                              FrameTime;                                     // 0x000C (0x0004) [0x0000000000000000]               
	float                                              FPS;                                           // 0x0010 (0x0004) [0x0000000000000000]               
	float                                              AccumGameThreadTime;                           // 0x0014 (0x0004) [0x0000000000000000]               
	float                                              AccumRenderThreadTime;                         // 0x0018 (0x0004) [0x0000000000000000]               
	float                                              AccumGPUTime;                                  // 0x001C (0x0004) [0x0000000000000000]               
	float                                              AccumFrameTime;                                // 0x0020 (0x0004) [0x0000000000000000]               
	int32_t                                            NumSamples;                                    // 0x0024 (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.MetricsEvent
// 0x0070
struct FMetricsEvent
{
	struct FUniqueNetId                                PlayerID;                                      // 0x0000 (0x0048) [0x0020000000400000] (CPF_NeedCtorLink)
	float                                              TimeSeconds;                                   // 0x0048 (0x0004) [0x0000000000000000]               
	int32_t                                            Version;                                       // 0x004C (0x0004) [0x0000000000000000]               
	class FString                                      EventName;                                     // 0x0050 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      EventData;                                     // 0x0060 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.ServerReservationData
// 0x0070
struct FServerReservationData
{
	class FString                                      ServerName;                                    // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            Playlist;                                      // 0x0010 (0x0004) [0x0000000000000000]               
	uint8_t                                           UnknownData00[0x4];                               		// 0x0014 (0x0004) MISSED OFFSET
	class FString                                      Region;                                        // 0x0018 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      ReservationID;                                 // 0x0028 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      DSRToken;                                      // 0x0038 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class UNetworkEncryptionKey*                       Keys;                                          // 0x0048 (0x0008) [0x0000000000000000]               
	class FString                                      JoinName;                                      // 0x0050 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      JoinPassword;                                  // 0x0060 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.CheckReservationResponse
// 0x007C
struct FCheckReservationResponse
{
	class FString                                      IP;                                            // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      ServerName;                                    // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            Playlist;                                      // 0x0020 (0x0004) [0x0000000000000000]               
	uint8_t                                           UnknownData00[0x4];                               		// 0x0024 (0x0004) MISSED OFFSET
	class FString                                      Region;                                        // 0x0028 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      Host;                                          // 0x0038 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            Port;                                          // 0x0048 (0x0004) [0x0000000000000000]               
	uint8_t                                           UnknownData01[0x4];                               		// 0x004C (0x0004) MISSED OFFSET
	class FString                                      ReservationID;                                 // 0x0050 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      DSConnectToken;                                // 0x0060 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class UNetworkEncryptionKey*                       Keys;                                          // 0x0070 (0x0008) [0x0000000000000000]               
	uint32_t                                           IsServerKey : 1;                               // 0x0078 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct ProjectX._Types_X.MapPrefs
// 0x0020
struct FMapPrefs
{
	TArray<struct FName>                               Likes;                                         // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<struct FName>                               Dislikes;                                      // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.GFxBlurRect
// 0x0020
struct FGFxBlurRect
{
	class FString                                      RectID;                                        // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	float                                              TopLeftX;                                      // 0x0010 (0x0004) [0x0000000000000000]               
	float                                              TopLeftY;                                      // 0x0014 (0x0004) [0x0000000000000000]               
	float                                              BottomRightX;                                  // 0x0018 (0x0004) [0x0000000000000000]               
	float                                              BottomRightY;                                  // 0x001C (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.PsyNetBeaconPlayerReservation
// 0x0060
struct FPsyNetBeaconPlayerReservation
{
	struct FUniqueNetId                                PlayerID;                                      // 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	class UNetworkEncryptionKey*                       Keys;                                          // 0x0048 (0x0008) [0x0000000000000000]               
	class FString                                      DSConnectToken;                                // 0x0050 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.PsyNetBeaconPartyReservation
// 0x0010
struct FPsyNetBeaconPartyReservation
{
	TArray<struct FUniqueNetId>                        Members;                                       // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.PsyNetBeaconReservation
// 0x0048
struct FPsyNetBeaconReservation
{
	class FString                                      ReservationID;                                 // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            Playlist;                                      // 0x0010 (0x0004) [0x0000000000000000]               
	uint32_t                                           IsBackfill : 1;                                // 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           IsBotMatch : 1;                                // 0x0014 (0x0004) [0x0000000000000000] [0x00000002] 
	TArray<class FString>                              BotNames;                                      // 0x0018 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<struct FPsyNetBeaconPlayerReservation>      Players;                                       // 0x0028 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<struct FPsyNetBeaconPartyReservation>       Parties;                                       // 0x0038 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.HonorDuelChallenge
// 0x0090
struct FHonorDuelChallenge
{
	struct FUniqueNetId                                Challenger;                                    // 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FUniqueNetId                                Defender;                                      // 0x0048 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.OnlineStatus
// 0x0059
struct FOnlineStatus
{
	struct FUniqueNetId                                PlayerID;                                      // 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      PresenceInfo;                                  // 0x0048 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	uint8_t                                            PresenceState;                                 // 0x0058 (0x0001) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.RegionSecret
// 0x0020
struct FRegionSecret
{
	class FString                                      Region;                                        // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      Secret;                                        // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.PsyNetPersonaData
// 0x0078
struct FPsyNetPersonaData
{
	struct FUniqueNetId                                PlayerID;                                      // 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      PlayerName;                                    // 0x0048 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      PresenceInfo;                                  // 0x0058 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      PresenceState;                                 // 0x0068 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.BumpAngleCheckConfig
// 0x0014
struct FBumpAngleCheckConfig
{
	uint32_t                                           bEnabled : 1;                                  // 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              BumpAngleYaw;                                  // 0x0004 (0x0004) [0x0000000000000000]               
	float                                              BumpAnglePitch;                                // 0x0008 (0x0004) [0x0000000000000000]               
	float                                              DemolishAngleYaw;                              // 0x000C (0x0004) [0x0000000000000000]               
	float                                              DemolishAnglePitch;                            // 0x0010 (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.BumpAngleCurveCheckConfig
// 0x0068
struct FBumpAngleCurveCheckConfig
{
	uint32_t                                           bEnabled : 1;                                  // 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	uint8_t                                           UnknownData00[0x4];                               		// 0x0004 (0x0004) MISSED OFFSET
	struct FInterpCurveFloat                           BumpAngleCurveYaw;                             // 0x0008 (0x0018) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FInterpCurveFloat                           BumpAngleCurvePitch;                           // 0x0020 (0x0018) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FInterpCurveFloat                           DemolishAngleCurveYaw;                         // 0x0038 (0x0018) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FInterpCurveFloat                           DemolishAngleCurvePitch;                       // 0x0050 (0x0018) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.CarInteractionConfig
// 0x0104
struct FCarInteractionConfig
{
	float                                              PushFactor;                                    // 0x0000 (0x0004) [0x0000000000000000]               
	uint8_t                                           UnknownData00[0x4];                               		// 0x0004 (0x0004) MISSED OFFSET
	struct FInterpCurveFloat                           BumperPushFactorCurveGround;                   // 0x0008 (0x0018) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FInterpCurveFloat                           BumperPushFactorCurveAir;                      // 0x0020 (0x0018) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FInterpCurveFloat                           ZPushFactorCurve;                              // 0x0038 (0x0018) [0x0000000000400000] (CPF_NeedCtorLink)
	float                                              BumpInterval;                                  // 0x0050 (0x0004) [0x0000000000000000]               
	struct FBumpAngleCheckConfig                       COMAngleCheck;                                 // 0x0054 (0x0014) [0x0000000000000000]               
	struct FBumpAngleCheckConfig                       VictimHitAngleCheck;                           // 0x0068 (0x0014) [0x0000000000000000]               
	struct FBumpAngleCheckConfig                       AttackerHitAngleCheck;                         // 0x007C (0x0014) [0x0000000000000000]               
	struct FBumpAngleCurveCheckConfig                  VictimHitAngleCurveCheck;                      // 0x0090 (0x0068) [0x0000000000400000] (CPF_NeedCtorLink)
	uint32_t                                           bCheckImpactNormal : 1;                        // 0x00F8 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              ImpactNormalDotProductDemo;                    // 0x00FC (0x0004) [0x0000000000000000]               
	float                                              ImpactNormalDotProductBump;                    // 0x0100 (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.SuperSonicConfig
// 0x000C
struct FSuperSonicConfig
{
	float                                              Speed;                                         // 0x0000 (0x0004) [0x0000000000000000]               
	float                                              TurnoffSpeedBuffer;                            // 0x0004 (0x0004) [0x0000000000000000]               
	float                                              TurnoffTime;                                   // 0x0008 (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.SkillRating
// 0x0008
struct FSkillRating
{
	float                                              Mu;                                            // 0x0000 (0x0004) [0x0000000000000000]               
	float                                              Sigma;                                         // 0x0004 (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.MigrationReservationData
// 0x00E0
struct FMigrationReservationData
{
	struct FUniqueNetId                                PlayerID;                                      // 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      PlayerName;                                    // 0x0048 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FUniqueNetId                                PartyID;                                       // 0x0058 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	uint8_t                                            Status;                                        // 0x00A0 (0x0001) [0x0000000000000000]               
	uint8_t                                           UnknownData00[0x3];                               		// 0x00A1 (0x0003) MISSED OFFSET
	uint32_t                                           bDisableCrossPlay : 1;                         // 0x00A4 (0x0004) [0x0000000000000000] [0x00000001] 
	uint8_t                                            Team;                                          // 0x00A8 (0x0001) [0x0000000000000000]               
	uint8_t                                           UnknownData01[0x3];                               		// 0x00A9 (0x0003) MISSED OFFSET
	struct FSkillRating                                Skill;                                         // 0x00AC (0x0008) [0x0000000000000000]               
	uint8_t                                           UnknownData02[0x4];                               		// 0x00B4 (0x0004) MISSED OFFSET
	TArray<struct FName>                               MapLikes;                                      // 0x00B8 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<struct FName>                               MapDislikes;                                   // 0x00C8 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class UNetworkEncryptionKey*                       SecurityKey;                                   // 0x00D8 (0x0008) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.ReservationData
// 0x0108
struct FReservationData
{
	struct FUniqueNetId                                PlayerID;                                      // 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      PlayerName;                                    // 0x0048 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FUniqueNetId                                PartyID;                                       // 0x0058 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	uint8_t                                            Status;                                        // 0x00A0 (0x0001) [0x0000000000000000]               
	uint8_t                                           UnknownData00[0x3];                               		// 0x00A1 (0x0003) MISSED OFFSET
	float                                              TimeoutTime;                                   // 0x00A4 (0x0004) [0x0000000000000000]               
	uint32_t                                           bDisableCrossPlay : 1;                         // 0x00A8 (0x0004) [0x0000000000000000] [0x00000001] 
	uint8_t                                           UnknownData01[0x4];                               		// 0x00AC (0x0004) MISSED OFFSET
	class APlayerReplicationInfo*                      PRI;                                           // 0x00B0 (0x0008) [0x0000000000000000]               
	uint8_t                                            Team;                                          // 0x00B8 (0x0001) [0x0000000000000000]               
	uint8_t                                           UnknownData02[0x7];                               		// 0x00B9 (0x0007) MISSED OFFSET
	class UAddReservationMessage_X*                    ReservationMessage;                            // 0x00C0 (0x0008) [0x0000000000000000]               
	class UIReservationConnection_X*                   Connection_Object;                             // 0x00C8 (0x0010) [0x0000000000000000] 
	class UIReservationConnection_X*                   Connection_Interface;                          // 0x00C8 (0x0010) [0x0000000000000000]               
	uint32_t                                           bIgnoreBeaconDisconnect : 1;                   // 0x00D8 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FSkillRating                                Skill;                                         // 0x00DC (0x0008) [0x0000000000000000]               
	uint8_t                                           UnknownData03[0x4];                               		// 0x00E4 (0x0004) MISSED OFFSET
	TArray<struct FName>                               MapLikes;                                      // 0x00E8 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<struct FName>                               MapDislikes;                                   // 0x00F8 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.PlayerTitleData
// 0x0028
struct FPlayerTitleData
{
	struct FName                                       Id;                                            // 0x0000 (0x0008) [0x0000000040000000] (CPF_EditInlineNotify)
	class FString                                      Text;                                          // 0x0008 (0x0010) [0x0000000040400000] (CPF_NeedCtorLink | CPF_EditInlineNotify)
	struct FName                                       Category;                                      // 0x0018 (0x0008) [0x0000000000000000]               
	struct FColor                                      Color;                                         // 0x0020 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	struct FColor                                      GlowColor;                                     // 0x0024 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
};

// ScriptStruct ProjectX._Types_X.PlayerSeasonRewardProgress
// 0x0050
struct FPlayerSeasonRewardProgress
{
	struct FUniqueNetId                                PlayerID;                                      // 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            SeasonLevel;                                   // 0x0048 (0x0004) [0x0000000000000000]               
	int32_t                                            SeasonLevelWins;                               // 0x004C (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.ActiveServerData
// 0x00A0
struct FActiveServerData
{
	struct FServerReservationData                      Reservation;                                   // 0x0000 (0x0070) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      PingURL;                                       // 0x0070 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      GameURL;                                       // 0x0080 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      JoinCredentials;                               // 0x0090 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.CrossplayGroup
// 0x0010
struct FCrossplayGroup
{
	TArray<uint8_t>                                    Platforms;                                     // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.ServerConnectionInfo
// 0x0030
struct FServerConnectionInfo
{
	class FString                                      ServerAddress;                                 // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      PingAddress;                                   // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      ServerName;                                    // 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.TierSkillRating
// 0x0018 (0x0008 - 0x0020)
struct FTierSkillRating : FSkillRating
{
	int32_t                                            Tier;                                          // 0x0008 (0x0004) [0x0000000000000000]               
	int32_t                                            Division;                                      // 0x000C (0x0004) [0x0000000000000000]               
	int32_t                                            MatchesPlayed;                                 // 0x0010 (0x0004) [0x0000000000000000]               
	int32_t                                            PlacementMatchesPlayed;                        // 0x0014 (0x0004) [0x0000000000000000]               
	int32_t                                            WinStreak;                                     // 0x0018 (0x0004) [0x0000000000000000]               
	float                                              MMR;                                           // 0x001C (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.SkillMatchPartyRating
// 0x0004 (0x0020 - 0x0024)
struct FSkillMatchPartyRating : FTierSkillRating
{
	int32_t                                            PartyID;                                       // 0x0020 (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.SkillMatchParty
// 0x0020
struct FSkillMatchParty
{
	int32_t                                            PartyID;                                       // 0x0000 (0x0004) [0x0000000000000000]               
	float                                              PctTimePlayed;                                 // 0x0004 (0x0004) [0x0000000000000000]               
	uint32_t                                           bQuitter : 1;                                  // 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	uint8_t                                           UnknownData00[0x4];                               		// 0x000C (0x0004) MISSED OFFSET
	TArray<struct FUniqueNetId>                        Players;                                       // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.SkillMatchData
// 0x0024
struct FSkillMatchData
{
	class FString                                      ServerId;                                      // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            Playlist;                                      // 0x0010 (0x0004) [0x0000000000000000]               
	int32_t                                            WinningTeam;                                   // 0x0014 (0x0004) [0x0000000000000000]               
	int32_t                                            Team0Score;                                    // 0x0018 (0x0004) [0x0000000000000000]               
	int32_t                                            Team1Score;                                    // 0x001C (0x0004) [0x0000000000000000]               
	uint32_t                                           bOverTime : 1;                                 // 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct ProjectX._Types_X.ClubColorSet
// 0x0008
struct FClubColorSet
{
	uint8_t                                            TeamColorID;                                   // 0x0000 (0x0001) [0x0000000000000000]               
	uint8_t                                            CustomColorID;                                 // 0x0001 (0x0001) [0x0000000000000000]               
	uint8_t                                           UnknownData00[0x2];                               		// 0x0002 (0x0002) MISSED OFFSET
	uint32_t                                           bTeamColorSet : 1;                             // 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bCustomColorSet : 1;                           // 0x0004 (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct ProjectX._Types_X.CustomMatchTeamSettings
// 0x001C
struct FCustomMatchTeamSettings
{
	class FString                                      Name;                                          // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FClubColorSet                               Colors;                                        // 0x0010 (0x0008) [0x0000000000000000]               
	int32_t                                            GameScore;                                     // 0x0018 (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.CustomMatchSettings
// 0x008C
struct FCustomMatchSettings
{
	class FString                                      GameTags;                                      // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FName                                       MapName;                                       // 0x0010 (0x0008) [0x0000000000000000]               
	uint8_t                                            GameMode;                                      // 0x0018 (0x0001) [0x0000000000000000]               
	uint8_t                                           UnknownData00[0x3];                               		// 0x0019 (0x0003) MISSED OFFSET
	int32_t                                            MaxPlayerCount;                                // 0x001C (0x0004) [0x0000000000000000]               
	class FString                                      ServerName;                                    // 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      Password;                                      // 0x0030 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	uint32_t                                           bPublic : 1;                                   // 0x0040 (0x0004) [0x0000000000000000] [0x00000001] 
	uint8_t                                           UnknownData01[0x4];                               		// 0x0044 (0x0004) MISSED OFFSET
	struct FCustomMatchTeamSettings                    TeamSettings[0x2];                             // 0x0048 (0x0040) [0x0000000000400000] (CPF_NeedCtorLink)
	uint32_t                                           bClubServer : 1;                               // 0x0088 (0x0004) [0x0001000000000000] [0x00000001] 
};

// ScriptStruct ProjectX._Types_X.ServerResult
// 0x00B0
struct FServerResult
{
	class FString                                      Address;                                       // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      ServerName;                                    // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FCustomMatchSettings                        Settings;                                      // 0x0020 (0x0090) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.SkillMatchPlayer
// 0x0060
struct FSkillMatchPlayer
{
	struct FUniqueNetId                                PlayerID;                                      // 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	float                                              PctTimePlayed;                                 // 0x0048 (0x0004) [0x0000000000000000]               
	float                                              TimePlayed;                                    // 0x004C (0x0004) [0x0000000000000000]               
	uint32_t                                           bQuitter : 1;                                  // 0x0050 (0x0004) [0x0000000000000000] [0x00000001] 
	int32_t                                            PartyID;                                       // 0x0054 (0x0004) [0x0000000000000000]               
	int32_t                                            Score;                                         // 0x0058 (0x0004) [0x0000000000000000]               
	int32_t                                            Team;                                          // 0x005C (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.ReplicatedReservationData
// 0x0059
struct FReplicatedReservationData
{
	struct FUniqueNetId                                PlayerID;                                      // 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      PlayerName;                                    // 0x0048 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	uint8_t                                            Status;                                        // 0x0058 (0x0001) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.PartyJoinMatchSettings
// 0x0058
struct FPartyJoinMatchSettings
{
	class FString                                      ServerName;                                    // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            PlaylistId;                                    // 0x0010 (0x0004) [0x0000000000000000]               
	uint32_t                                           bFriendJoin : 1;                               // 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
	class FString                                      CustomPassword;                                // 0x0018 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      ReservationID;                                 // 0x0028 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      JoinName;                                      // 0x0038 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      JoinPassword;                                  // 0x0048 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.JoinMatchSettings
// 0x0020
struct FJoinMatchSettings
{
	uint8_t                                            MatchType;                                     // 0x0000 (0x0001) [0x0000000000000000]               
	uint8_t                                           UnknownData00[0x3];                               		// 0x0001 (0x0003) MISSED OFFSET
	int32_t                                            PlaylistId;                                    // 0x0004 (0x0004) [0x0000000000000000]               
	uint32_t                                           bFriendJoin : 1;                               // 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bMigration : 1;                                // 0x0008 (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           bRankedReconnect : 1;                          // 0x0008 (0x0004) [0x0000000000000000] [0x00000004] 
	uint8_t                                           UnknownData01[0x4];                               		// 0x000C (0x0004) MISSED OFFSET
	class FString                                      Password;                                      // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.ReservationPlayerData
// 0x00A0
struct FReservationPlayerData
{
	struct FUniqueNetId                                PlayerID;                                      // 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      PlayerName;                                    // 0x0048 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	float                                              SkillMu;                                       // 0x0058 (0x0004) [0x0000000000000000]               
	float                                              SkillSigma;                                    // 0x005C (0x0004) [0x0000000000000000]               
	int32_t                                            Tier;                                          // 0x0060 (0x0004) [0x0000000000000000]               
	uint32_t                                           bRemotePlayer : 1;                             // 0x0064 (0x0004) [0x0000000000000000] [0x00000001] 
	TArray<int32_t>                                    Loadout;                                       // 0x0068 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<struct FName>                               MapLikes;                                      // 0x0078 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<struct FName>                               MapDislikes;                                   // 0x0088 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	uint64_t                                           ClubID;                                        // 0x0098 (0x0008) [0x0001000000000000]               
};

// ScriptStruct ProjectX._Types_X.ReplicatedRBStateNoQuat
// 0x0038
struct FReplicatedRBStateNoQuat
{
	float                                              QuatX;                                         // 0x0000 (0x0004) [0x0000000000000000]               
	float                                              QuatY;                                         // 0x0004 (0x0004) [0x0000000000000000]               
	float                                              QuatZ;                                         // 0x0008 (0x0004) [0x0000000000000000]               
	float                                              QuatW;                                         // 0x000C (0x0004) [0x0000000000000000]               
	struct FVector                                     Location;                                      // 0x0010 (0x000C) [0x0000000000000000]               
	struct FVector                                     LinearVelocity;                                // 0x001C (0x000C) [0x0000000000000000]               
	struct FVector                                     AngularVelocity;                               // 0x0028 (0x000C) [0x0000000000000000]               
	uint32_t                                           bSleeping : 1;                                 // 0x0034 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct ProjectX._Types_X.ReplicatedRBState
// 0x003C
struct FReplicatedRBState
{
	struct FQuat                                       Quaternion;                                    // 0x0000 (0x0010) [0x0000000000000000]               
	struct FVector                                     Location;                                      // 0x0010 (0x000C) [0x0000000000000000]               
	struct FVector                                     LinearVelocity;                                // 0x001C (0x000C) [0x0000000000000000]               
	struct FVector                                     AngularVelocity;                               // 0x0028 (0x000C) [0x0000000000000000]               
	float                                              Time;                                          // 0x0034 (0x0004) [0x0000000000000000]               
	uint32_t                                           bSleeping : 1;                                 // 0x0038 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bNewData : 1;                                  // 0x0038 (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct ProjectX._Types_X.PlayerBinding
// 0x002C
struct FPlayerBinding
{
	struct FName                                       Action;                                        // 0x0000 (0x0008) [0x0000000040000000] (CPF_EditInlineNotify)
	struct FName                                       Key;                                           // 0x0008 (0x0008) [0x0000000040000000] (CPF_EditInlineNotify)
	uint8_t                                            AxisSign;                                      // 0x0010 (0x0001) [0x0000000040000000] (CPF_EditInlineNotify)
	uint8_t                                            PressType;                                     // 0x0011 (0x0001) [0x0000000040000000] (CPF_EditInlineNotify)
	uint8_t                                           UnknownData00[0x2];                               		// 0x0012 (0x0002) MISSED OFFSET
	float                                              Speed;                                         // 0x0014 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	uint32_t                                           bRequired : 1;                                 // 0x0018 (0x0004) [0x0000000040000000] [0x00000001] (CPF_EditInlineNotify)
	uint8_t                                            Remappable;                                    // 0x001C (0x0001) [0x0000000000000000]               
	uint8_t                                           UnknownData01[0x3];                               		// 0x001D (0x0003) MISSED OFFSET
	float                                              PressedTime;                                   // 0x0020 (0x0004) [0x0000000000002000] (CPF_Transient)
	float                                              ReleasedTime;                                  // 0x0024 (0x0004) [0x0000000000002000] (CPF_Transient)
	uint32_t                                           bTapped : 1;                                   // 0x0028 (0x0004) [0x0000000000002000] [0x00000001] (CPF_Transient)
	uint32_t                                           bToggled : 1;                                  // 0x0028 (0x0004) [0x0000000000002000] [0x00000002] (CPF_Transient)
};

// ScriptStruct ProjectX._Types_X.BindingAction
// 0x0038
struct FBindingAction
{
	struct FName                                       Action;                                        // 0x0000 (0x0008) [0x0000000040000000] (CPF_EditInlineNotify)
	struct FName                                       Category;                                      // 0x0008 (0x0008) [0x0000000040000000] (CPF_EditInlineNotify)
	struct FName                                       Axis;                                          // 0x0010 (0x0008) [0x0000000040000000] (CPF_EditInlineNotify)
	uint8_t                                            AxisSign;                                      // 0x0018 (0x0001) [0x0000000040000000] (CPF_EditInlineNotify)
	uint8_t                                           UnknownData00[0x7];                               		// 0x0019 (0x0007) MISSED OFFSET
	class FString                                      Command;                                       // 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	uint32_t                                           bDisableRemapping : 1;                         // 0x0030 (0x0004) [0x0000000000000000] [0x00000001] 
	int32_t                                            Priority;                                      // 0x0034 (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.PlaylistTierSkillRating
// 0x0004 (0x0020 - 0x0024)
struct FPlaylistTierSkillRating : FTierSkillRating
{
	int32_t                                            Playlist;                                      // 0x0020 (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.PlayerPermissions
// 0x0008
struct FPlayerPermissions
{
	uint8_t                                            TextChat;                                      // 0x0000 (0x0001) [0x0000000000000000]               
	uint8_t                                            VoiceChat;                                     // 0x0001 (0x0001) [0x0000000000000000]               
	uint8_t                                            Trade;                                         // 0x0002 (0x0001) [0x0000000000000000]               
	uint8_t                                           UnknownData00[0x1];                               		// 0x0003 (0x0001) MISSED OFFSET
	uint32_t                                           bRequirePinForFriends : 1;                     // 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bItemShopNotificationsAllowed : 1;             // 0x0004 (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct ProjectX._Types_X.PlaylistSkillRating
// 0x0004 (0x0020 - 0x0024)
struct FPlaylistSkillRating : FTierSkillRating
{
	int32_t                                            Playlist;                                      // 0x0020 (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.PlayerSkillRating
// 0x004C (0x0024 - 0x0070)
struct FPlayerSkillRating : FPlaylistSkillRating
{
	uint8_t                                           UnknownData00[0x4];                               		// 0x0024 (0x0004) MISSED OFFSET
	struct FUniqueNetId                                PlayerID;                                      // 0x0028 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.UpdatedPlayerSkillRating
// 0x0010 (0x0070 - 0x0080)
struct FUpdatedPlayerSkillRating : FPlayerSkillRating
{
	float                                              PrevMu;                                        // 0x0070 (0x0004) [0x0000000000000000]               
	float                                              PrevSigma;                                     // 0x0074 (0x0004) [0x0000000000000000]               
	int32_t                                            PrevTier;                                      // 0x0078 (0x0004) [0x0000000000000000]               
	int32_t                                            PrevDivision;                                  // 0x007C (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.CachedRegionPing
// 0x000C
struct FCachedRegionPing
{
	struct FName                                       Name;                                          // 0x0000 (0x0008) [0x0000000000000000]               
	float                                              Ping;                                          // 0x0008 (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.PartyMemberServer
// 0x0044
struct FPartyMemberServer
{
	class FString                                      ServerName;                                    // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      CustomPassword;                                // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      JoinName;                                      // 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      JoinPassword;                                  // 0x0030 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            PlaylistId;                                    // 0x0040 (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.PartyMember
// 0x0170
struct FPartyMember
{
	struct FUniqueNetId                                PrimaryMemberId;                               // 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FUniqueNetId                                MemberId;                                      // 0x0048 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      MemberName;                                    // 0x0090 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            MatchmakeRestrictions;                         // 0x00A0 (0x0004) [0x0000000000000000]               
	int32_t                                            LocalControllerId;                             // 0x00A4 (0x0004) [0x0000000000000000]               
	int32_t                                            XpLevel;                                       // 0x00A8 (0x0004) [0x0000000000000000]               
	uint8_t                                            CrossChatState;                                // 0x00AC (0x0001) [0x0000000000000000]               
	uint8_t                                           UnknownData00[0x3];                               		// 0x00AD (0x0003) MISSED OFFSET
	uint32_t                                           bDisableCrossPlay : 1;                         // 0x00B0 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bTradingEnabled : 1;                           // 0x00B0 (0x0004) [0x0000000000000000] [0x00000002] 
	uint8_t                                           UnknownData01[0x4];                               		// 0x00B4 (0x0004) MISSED OFFSET
	struct FUniqueNetId                                TradingMemberId;                               // 0x00B8 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FGuid                                       TradeId;                                       // 0x0100 (0x0010) [0x0000000000000000]               
	uint32_t                                           bReadyToLockTrade : 1;                         // 0x0110 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bReadyToConfirmTrade : 1;                      // 0x0110 (0x0004) [0x0000000000000000] [0x00000002] 
	uint8_t                                           UnknownData02[0x4];                               		// 0x0114 (0x0004) MISSED OFFSET
	struct FPartyMemberServer                          Server;                                        // 0x0118 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FUniqueLobbyId                              PlatformParty;                                 // 0x0160 (0x0010) [0x0001000000000000]               
};

// ScriptStruct ProjectX._Types_X.PlayerTitleCategory
// 0x0028
struct FPlayerTitleCategory
{
	struct FName                                       Id;                                            // 0x0000 (0x0008) [0x0000000000000000]               
	class FString                                      Color;                                         // 0x0008 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      GlowColor;                                     // 0x0018 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.IntVector3
// 0x000C
struct FIntVector3
{
	int32_t                                            X;                                             // 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
	int32_t                                            Y;                                             // 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
	int32_t                                            Z;                                             // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct ProjectX._Types_X.DownloadedImage
// 0x0018
struct FDownloadedImage
{
	class FString                                      URL;                                           // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class UTexture2DDynamic*                           Texture;                                       // 0x0010 (0x0008) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.ClubMember
// 0x00A0
struct FClubMember
{
	struct FUniqueNetId                                PlayerID;                                      // 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FUniqueNetId                                EpicPlayerID;                                  // 0x0048 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      PlayerName;                                    // 0x0090 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.PlayerPermissionsList
// 0x0058
struct FPlayerPermissionsList
{
	struct FUniqueNetId                                PlayerID;                                      // 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<uint8_t>                                    Permissions;                                   // 0x0048 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.NetStats
// 0x000C
struct FNetStats
{
	float                                              PingMin;                                       // 0x0000 (0x0004) [0x0000000000000000]               
	float                                              Jitter;                                        // 0x0004 (0x0004) [0x0000000000000000]               
	float                                              LossPct;                                       // 0x0008 (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX.SetPlayerStorageResult_X.SetPlayerStorageResultItem
// 0x0010
struct FSetPlayerStorageResultItem
{
	struct FName                                       Category;                                      // 0x0000 (0x0008) [0x0001000000000000]               
	int32_t                                            Tick;                                          // 0x0008 (0x0004) [0x0001000000000000]               
	uint32_t                                           bOutOfSync : 1;                                // 0x000C (0x0004) [0x0001000000000000] [0x00000001] 
};

// ScriptStruct ProjectX.OnlinePlayerStorageQueue_X.PendingStorage
// 0x0014
struct FPendingStorage
{
	class UObject*                                     Data;                                          // 0x0000 (0x0008) [0x0001000000000000]               
	class UClass*                                      DataClass;                                     // 0x0008 (0x0008) [0x0001000000000000]               
	int32_t                                            Tick;                                          // 0x0010 (0x0004) [0x0001000000000000]               
};

// ScriptStruct ProjectX.BlockStatusReporter_X.PlayerBlockListenData
// 0x0028
struct FPlayerBlockListenData
{
	class FString                                      EpicId;                                        // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FScriptDelegate                             Callback;                                      // 0x0010 (0x0018) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX.CabinedModeResponse.CabinedModeData
// 0x0004
struct FCabinedModeData
{
	uint32_t                                           cabinedMode : 1;                               // 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct ProjectX.OnlineGameMatchmaking_X.DSRegionInfo
// 0x0014
struct FDSRegionInfo
{
	class FString                                      Name;                                          // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            Ping;                                          // 0x0010 (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX.OnlineMessageComponent_X.OnlineMessageHandler
// 0x0018
struct FOnlineMessageHandler
{
	class UClass*                                      MessageClass;                                  // 0x0000 (0x0008) [0x0000000000000000]               
	TArray<struct FScriptDelegate>                     Delegates;                                     // 0x0008 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX.PartyMessage_LocalPlayers_X.SimplePartyMember
// 0x0058
struct FSimplePartyMember
{
	struct FUniqueNetId                                MemberId;                                      // 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      MemberName;                                    // 0x0048 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX.OnlineGameParty_X.PlaylistRestrictionPlayer
// 0x004C
struct FPlaylistRestrictionPlayer
{
	struct FUniqueNetId                                PlayerID;                                      // 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            Tier;                                          // 0x0048 (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX.OnlinePlayerFriends_X.EpicSocialTaskData
// 0x0060
struct FEpicSocialTaskData
{
	struct FUniqueNetId                                PlayerID;                                      // 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FScriptDelegate                             OnCompleteCallback;                            // 0x0048 (0x0018) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX.OnlinePlayerStorageQueue_X.StorageMaxSize
// 0x000C
struct FStorageMaxSize
{
	struct FName                                       Category;                                      // 0x0000 (0x0008) [0x0001000000000000]               
	int32_t                                            MaxSizeBytes;                                  // 0x0008 (0x0004) [0x0001000000000000]               
};

// ScriptStruct ProjectX.RPC_PlayerStorageSet_X.SetPlayerStorageRequestItem
// 0x0021
struct FSetPlayerStorageRequestItem
{
	struct FName                                       Category;                                      // 0x0000 (0x0008) [0x0001000000000000]               
	int32_t                                            Tick;                                          // 0x0008 (0x0004) [0x0001000000000000]               
	int32_t                                            Checksum;                                      // 0x000C (0x0004) [0x0001000000000000]               
	class FString                                      Data;                                          // 0x0010 (0x0010) [0x0001000000400000] (CPF_NeedCtorLink)
	uint8_t                                            Encoding;                                      // 0x0020 (0x0001) [0x0001000000000000]               
};

