/*
#############################################################################################
# RocketLeague (1.0.10897.0) SDK
# Generated with the CodeRedGenerator v1.0.2
# ========================================================================================= #
# File: TAGame_structs.hpp
# ========================================================================================= #
# Credits: TheFeckless, ItsBranK
# Links: www.github.com/CodeRedModding/CodeRed-Generator, www.twitter.com/ItsBranK
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x1)
#endif

/*
# ========================================================================================= #
# Structs
# ========================================================================================= #
*/

// ScriptStruct TAGame.ConsecutiveMatchTracker_TA.MatchData
// 0x004C
struct FMatchData
{
	struct FUniqueNetId                                PlayerID;                                      // 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            ConsecutiveMatchesPlayed;                      // 0x0048 (0x0004) [0x0000000000000000]               
};

// ScriptStruct TAGame.Profile_TA.ProfileProduct
// 0x0020
struct FProfileProduct
{
	struct FProductInstanceID                          InstanceID;                                    // 0x0000 (0x0010) [0x0000000000000000]               
	TArray<class UProductAttribute_TA*>                Attributes;                                    // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.PlayerActorIDPair
// 0x0050
struct FPlayerActorIDPair
{
	int32_t                                            ActorID;                                       // 0x0000 (0x0004) [0x0000000000000000]               
	uint8_t                                           UnknownData00[0x4];                               		// 0x0004 (0x0004) MISSED OFFSET
	struct FUniqueNetId                                PlayerID;                                      // 0x0008 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.PaintWithOverride
// 0x0018
struct FPaintWithOverride
{
	class UProductPaint_TA*                            PaintToOverride;                               // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	TArray<class UProductOverride_TA*>                 Overrides;                                     // 0x0008 (0x0010) [0x0000000004400001] (CPF_Edit | CPF_NeedCtorLink | CPF_EditInline)
};

// ScriptStruct TAGame._Types_TA.PersonaDataId
// 0x0048
struct FPersonaDataId
{
	struct FUniqueNetId                                PersonaId;                                     // 0x0000 (0x0048) [0x0000000040400000] (CPF_NeedCtorLink | CPF_EditInlineNotify)
};

// ScriptStruct TAGame._Types_TA.WaveParams
// 0x0008
struct FWaveParams
{
	float                                              Frequency;                                     // 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              Amplitude;                                     // 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct TAGame._Types_TA.StickyForceData
// 0x0008
struct FStickyForceData
{
	float                                              Ground;                                        // 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              Wall;                                          // 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct TAGame._Types_TA.AutoFlipData
// 0x0008
struct FAutoFlipData
{
	float                                              Torque;                                        // 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              Force;                                         // 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct TAGame._Types_TA.PartyUpMergeError
// 0x0098
struct FPartyUpMergeError
{
	struct FUniqueNetId                                PlayerID;                                      // 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FUniqueNetId                                LeaderID;                                      // 0x0048 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	class UError*                                      Error;                                         // 0x0090 (0x0008) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.BodyToEngineAudioPair
// 0x0010
struct FBodyToEngineAudioPair
{
	class UProduct_TA*                                 Body;                                          // 0x0000 (0x0008) [0x0000000000000000]               
	class UProduct_TA*                                 EngineAudio;                                   // 0x0008 (0x0008) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.FPSBucketMetrics
// 0x0020
struct FFPSBucketMetrics
{
	int32_t                                            FPS;                                           // 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
	int32_t                                            FrameCount;                                    // 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              PercentTime;                                   // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              AverageGameThreadTime;                         // 0x000C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              AverageRenderThreadTime;                       // 0x0010 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              AverageGPUFrameTime;                           // 0x0014 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              UndockedAverageResolutionIndex;                // 0x0018 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DockedAverageResolutionIndex;                  // 0x001C (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct TAGame._Types_TA.PlaylistMapPrefs
// 0x000C (0x0020 - 0x002C)
struct FPlaylistMapPrefs : FMapPrefs
{
	struct FName                                       Playlist;                                      // 0x0020 (0x0008) [0x0000000000000000]               
	uint32_t                                           bOverrideGlobal : 1;                           // 0x0028 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct TAGame._Types_TA.MapGroup
// 0x0010
struct FMapGroup
{
	TArray<class UMapData_TA*>                         Maps;                                          // 0x0000 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.GFxTeamColor
// 0x0010
struct FGFxTeamColor
{
	struct FColor                                      Value;                                         // 0x0000 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	int32_t                                            ColorID;                                       // 0x0004 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	int32_t                                            X;                                             // 0x0008 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	int32_t                                            Y;                                             // 0x000C (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
};

// ScriptStruct TAGame._Types_TA.UISavedKeyValue
// 0x0018
struct FUISavedKeyValue
{
	struct FName                                       Key;                                           // 0x0000 (0x0008) [0x0000000000000000]               
	class FString                                      Value;                                         // 0x0008 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.DemolishData
// 0x0028
struct FDemolishData
{
	class ARBActor_TA*                                 Attacker;                                      // 0x0000 (0x0008) [0x0000000000000000]               
	class ACar_TA*                                     Victim;                                        // 0x0008 (0x0008) [0x0000000000000000]               
	struct FVector                                     AttackerVelocity;                              // 0x0010 (0x000C) [0x0000000000000000]               
	struct FVector                                     VictimVelocity;                                // 0x001C (0x000C) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.OnlineProductAttribute
// 0x0018
struct FOnlineProductAttribute
{
	struct FName                                       Key;                                           // 0x0000 (0x0008) [0x0000000000000000]               
	class FString                                      Value;                                         // 0x0008 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.OnlineProductData
// 0x0040
struct FOnlineProductData
{
	int32_t                                            ProductID;                                     // 0x0000 (0x0004) [0x0000000000000000]               
	uint8_t                                           UnknownData00[0x4];                               		// 0x0004 (0x0004) MISSED OFFSET
	struct FProductInstanceID                          InstanceID;                                    // 0x0008 (0x0010) [0x0000000000000000]               
	int32_t                                            SeriesID;                                      // 0x0018 (0x0004) [0x0000000000000000]               
	uint8_t                                           UnknownData01[0x4];                               		// 0x001C (0x0004) MISSED OFFSET
	TArray<struct FOnlineProductAttribute>             Attributes;                                    // 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            TradeHold;                                     // 0x0030 (0x0004) [0x0000000000000000]               
	uint8_t                                           UnknownData02[0x4];                               		// 0x0034 (0x0004) MISSED OFFSET
	uint64_t                                           AddedTimestamp;                                // 0x0038 (0x0008) [0x0000000000000000]               
};

// ScriptStruct TAGame._ShopTypes_TA.ItemShopNotificationData
// 0x0048
struct FItemShopNotificationData
{
	int32_t                                            ShopNotificationID;                            // 0x0000 (0x0004) [0x0000000000000000]               
	int32_t                                            ShopItemCostID;                                // 0x0004 (0x0004) [0x0000000000000000]               
	uint64_t                                           StartTime;                                     // 0x0008 (0x0008) [0x0000000000000000]               
	uint64_t                                           EndTime;                                       // 0x0010 (0x0008) [0x0000000000000000]               
	class FString                                      ImageURL;                                      // 0x0018 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      Title;                                         // 0x0028 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<struct FOnlineProductData>                  DeliverableProducts;                           // 0x0038 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._ShopTypes_TA.ShopCurrencyInfo
// 0x0008
struct FShopCurrencyInfo
{
	int32_t                                            Id;                                            // 0x0000 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	int32_t                                            Amount;                                        // 0x0004 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
};

// ScriptStruct TAGame._ShopTypes_TA.DestructionProductValue
// 0x0020
struct FDestructionProductValue
{
	struct FProductInstanceID                          ProductInstanceID;                             // 0x0000 (0x0010) [0x0000000040000000] (CPF_EditInlineNotify)
	TArray<struct FShopCurrencyInfo>                   Value;                                         // 0x0010 (0x0010) [0x0000000040400000] (CPF_NeedCtorLink | CPF_EditInlineNotify)
};

// ScriptStruct TAGame._ShopTypes_TA.ShopData
// 0x0058
struct FShopData
{
	int32_t                                            Id;                                            // 0x0000 (0x0004) [0x0000000000000000]               
	uint8_t                                           UnknownData00[0x4];                               		// 0x0004 (0x0004) MISSED OFFSET
	class FString                                      Name;                                          // 0x0008 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      Title;                                         // 0x0018 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      Type;                                          // 0x0028 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	uint64_t                                           StartDate;                                     // 0x0038 (0x0008) [0x0000000000000000]               
	uint64_t                                           EndDate;                                       // 0x0040 (0x0008) [0x0000000000000000]               
	class FString                                      LogoURL;                                       // 0x0048 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._ShopTypes_TA.ShopDeliverable
// 0x0060
struct FShopDeliverable
{
	int32_t                                            Count;                                         // 0x0000 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	uint8_t                                           UnknownData00[0x4];                               		// 0x0004 (0x0004) MISSED OFFSET
	struct FProductInstanceID                          Id;                                            // 0x0008 (0x0010) [0x0000000040000000] (CPF_EditInlineNotify)
	struct FProductHashID                              HashID;                                        // 0x0018 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	uint32_t                                           bOwned : 1;                                    // 0x001C (0x0004) [0x0000000040000000] [0x00000001] (CPF_EditInlineNotify)
	uint32_t                                           bOwnedUntradeable : 1;                         // 0x001C (0x0004) [0x0000000040000000] [0x00000002] (CPF_EditInlineNotify)
	struct FOnlineProductData                          Product;                                       // 0x0020 (0x0040) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._ShopTypes_TA.ShopPrice
// 0x0008
struct FShopPrice
{
	int32_t                                            Id;                                            // 0x0000 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	int32_t                                            Amount;                                        // 0x0004 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
};

// ScriptStruct TAGame._ShopTypes_TA.ShopDiscount
// 0x002C
struct FShopDiscount
{
	int32_t                                            Id;                                            // 0x0000 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	int32_t                                            ShopItemCostID;                                // 0x0004 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	uint64_t                                           StartDate;                                     // 0x0008 (0x0008) [0x0000000040000000] (CPF_EditInlineNotify)
	uint64_t                                           EndDate;                                       // 0x0010 (0x0008) [0x0000000040000000] (CPF_EditInlineNotify)
	TArray<struct FShopPrice>                          Price;                                         // 0x0018 (0x0010) [0x0000000040400000] (CPF_NeedCtorLink | CPF_EditInlineNotify)
	int32_t                                            Quantity;                                      // 0x0028 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
};

// ScriptStruct TAGame._ShopTypes_TA.ShopCost
// 0x0069
struct FShopCost
{
	int32_t                                            ShopItemCostID;                                // 0x0000 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	uint8_t                                           UnknownData00[0x4];                               		// 0x0004 (0x0004) MISSED OFFSET
	TArray<struct FShopPrice>                          Price;                                         // 0x0008 (0x0010) [0x0000000040400000] (CPF_NeedCtorLink | CPF_EditInlineNotify)
	struct FShopDiscount                               Discount;                                      // 0x0018 (0x0030) [0x0000000040400000] (CPF_NeedCtorLink | CPF_EditInlineNotify)
	uint64_t                                           StartDate;                                     // 0x0048 (0x0008) [0x0000000040000000] (CPF_EditInlineNotify)
	uint64_t                                           EndDate;                                       // 0x0050 (0x0008) [0x0000000040000000] (CPF_EditInlineNotify)
	TArray<struct FShopDiscount>                       BulkDiscounts;                                 // 0x0058 (0x0010) [0x0000000040400000] (CPF_NeedCtorLink | CPF_EditInlineNotify)
	uint8_t                                            DisplayTypeID;                                 // 0x0068 (0x0001) [0x0000000040000000] (CPF_EditInlineNotify)
};

// ScriptStruct TAGame._ShopTypes_TA.OnlineShopAttribute
// 0x0018
struct FOnlineShopAttribute
{
	struct FName                                       Key;                                           // 0x0000 (0x0008) [0x0000000040000000] (CPF_EditInlineNotify)
	class FString                                      Value;                                         // 0x0008 (0x0010) [0x0000000040400000] (CPF_NeedCtorLink | CPF_EditInlineNotify)
};

// ScriptStruct TAGame._ShopTypes_TA.ShopItem
// 0x00CC
struct FShopItem
{
	int32_t                                            ShopItemID;                                    // 0x0000 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	uint32_t                                           Purchasable : 1;                               // 0x0004 (0x0004) [0x0000000040000000] [0x00000001] (CPF_EditInlineNotify)
	int32_t                                            PurchasedQuantity;                             // 0x0008 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	int32_t                                            MaxQuantityPerPlayer;                          // 0x000C (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	uint64_t                                           StartDate;                                     // 0x0010 (0x0008) [0x0000000040000000] (CPF_EditInlineNotify)
	uint64_t                                           EndDate;                                       // 0x0018 (0x0008) [0x0000000040000000] (CPF_EditInlineNotify)
	TArray<struct FShopDeliverable>                    DeliverableProducts;                           // 0x0020 (0x0010) [0x0000000040400000] (CPF_NeedCtorLink | CPF_EditInlineNotify)
	TArray<struct FShopCurrencyInfo>                   DeliverableCurrencies;                         // 0x0030 (0x0010) [0x0000000040400000] (CPF_NeedCtorLink | CPF_EditInlineNotify)
	TArray<struct FShopCost>                           Costs;                                         // 0x0040 (0x0010) [0x0000000040400000] (CPF_NeedCtorLink | CPF_EditInlineNotify)
	TArray<class FString>                              FeaturedCollections;                           // 0x0050 (0x0010) [0x0000000040400000] (CPF_NeedCtorLink | CPF_EditInlineNotify)
	TArray<int32_t>                                    ShopItemLocations;                             // 0x0060 (0x0010) [0x0000000040400000] (CPF_NeedCtorLink | CPF_EditInlineNotify)
	class FString                                      Title;                                         // 0x0070 (0x0010) [0x0000000040400000] (CPF_NeedCtorLink | CPF_EditInlineNotify)
	class FString                                      Description;                                   // 0x0080 (0x0010) [0x0000000040400000] (CPF_NeedCtorLink | CPF_EditInlineNotify)
	class FString                                      disclaimer;                                    // 0x0090 (0x0010) [0x0000000040400000] (CPF_NeedCtorLink | CPF_EditInlineNotify)
	TArray<struct FOnlineShopAttribute>                Attributes;                                    // 0x00A0 (0x0010) [0x0000000040400000] (CPF_NeedCtorLink | CPF_EditInlineNotify)
	class FString                                      ImageURL;                                      // 0x00B0 (0x0010) [0x0000000040400000] (CPF_NeedCtorLink | CPF_EditInlineNotify)
	class UTexture*                                    ItemTexture;                                   // 0x00C0 (0x0008) [0x0000000040000000] (CPF_EditInlineNotify)
	uint32_t                                           bOwnsAllUntradeableProducts : 1;               // 0x00C8 (0x0004) [0x0000000040000000] [0x00000001] (CPF_EditInlineNotify)
};

// ScriptStruct TAGame._ShopTypes_TA.CurrencyProductData
// 0x0010
struct U_ShopTypes_TA_FCurrencyProductData
{
	class UProduct_TA*                                 Product;                                       // 0x0000 (0x0008) [0x0000000000000000]               
	class UOnlineProduct_TA*                           OnlineProduct;                                 // 0x0008 (0x0008) [0x0000000000000000]               
};

// ScriptStruct TAGame._ShopTypes_TA.ShopCurrency
// 0x0058
struct FShopCurrency
{
	uint8_t                                            Type;                                          // 0x0000 (0x0001) [0x0000000000000000]               
	uint8_t                                           UnknownData00[0x3];                               		// 0x0001 (0x0003) MISSED OFFSET
	int32_t                                            Id;                                            // 0x0004 (0x0004) [0x0000000000000000]               
	class UTexture*                                    SmallImage;                                    // 0x0008 (0x0008) [0x0000000000000000]               
	class UTexture*                                    LargeImage;                                    // 0x0010 (0x0008) [0x0000000000000000]               
	int32_t                                            Amount;                                        // 0x0018 (0x0004) [0x0000000000000000]               
	uint8_t                                           UnknownData01[0x4];                               		// 0x001C (0x0004) MISSED OFFSET
	class FString                                      Name;                                          // 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      LocalizedName;                                 // 0x0030 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	uint32_t                                           bCanBeTraded : 1;                              // 0x0040 (0x0004) [0x0000000000000000] [0x00000001] 
	int32_t                                            TradeHold;                                     // 0x0044 (0x0004) [0x0000000000000000]               
	struct U_ShopTypes_TA_FCurrencyProductData         ProductData;                                   // 0x0048 (0x0010) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.XPRewardData
// 0x000C
struct FXPRewardData
{
	struct FName                                       Name;                                          // 0x0000 (0x0008) [0x0000000040000000] (CPF_EditInlineNotify)
	float                                              Amount;                                        // 0x0008 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
};

// ScriptStruct TAGame._ShopTypes_TA.ShopCurrencyData
// 0x0008
struct FShopCurrencyData
{
	int32_t                                            Id;                                            // 0x0000 (0x0004) [0x0000000000000000]               
	int32_t                                            Amount;                                        // 0x0004 (0x0004) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.VoiceRoomCredentials
// 0x0030
struct FVoiceRoomCredentials
{
	class FString                                      RoomId;                                        // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      BaseUrl;                                       // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      Token;                                         // 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.PlayerVoiceRoomCredentials
// 0x0048 (0x0030 - 0x0078)
struct FPlayerVoiceRoomCredentials : FVoiceRoomCredentials
{
	struct FUniqueNetId                                PlayerID;                                      // 0x0030 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.ActivePlayerVoice
// 0x0011
struct FActivePlayerVoice
{
	uint64_t                                           StartTimestamp;                                // 0x0000 (0x0008) [0x0000000000000000]               
	uint64_t                                           EndTimestamp;                                  // 0x0008 (0x0008) [0x0000000000000000]               
	uint8_t                                            Location;                                      // 0x0010 (0x0001) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.VoiceRoomErrorMetric
// 0x0010
struct FVoiceRoomErrorMetric
{
	struct FName                                       ErrorName;                                     // 0x0000 (0x0008) [0x0000000000000000]               
	uint64_t                                           TimeStamp;                                     // 0x0008 (0x0008) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.VoiceRoomPlayerActivity
// 0x0020
struct FVoiceRoomPlayerActivity
{
	TArray<struct FActivePlayerVoice>                  ActiveVoiceSummary;                            // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<struct FVoiceRoomErrorMetric>               Errors;                                        // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.VoiceRoomDetails
// 0x0028
struct FVoiceRoomDetails
{
	class FString                                      RoomName;                                      // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	uint8_t                                            RoomType;                                      // 0x0010 (0x0001) [0x0000000000000000]               
	uint8_t                                           UnknownData00[0x7];                               		// 0x0011 (0x0007) MISSED OFFSET
	uint64_t                                           CreatedTimestamp;                              // 0x0018 (0x0008) [0x0000000000000000]               
	uint64_t                                           DestroyedTimestamp;                            // 0x0020 (0x0008) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.VehicleInputs
// 0x0020
struct FVehicleInputs
{
	float                                              Throttle;                                      // 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              Steer;                                         // 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              Pitch;                                         // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              Yaw;                                           // 0x000C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              Roll;                                          // 0x0010 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DodgeForward;                                  // 0x0014 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DodgeRight;                                    // 0x0018 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bHandbrake : 1;                                // 0x001C (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	uint32_t                                           bJump : 1;                                     // 0x001C (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bActivateBoost : 1;                            // 0x001C (0x0004) [0x0000000000000001] [0x00000004] (CPF_Edit)
	uint32_t                                           bHoldingBoost : 1;                             // 0x001C (0x0004) [0x0000000000000001] [0x00000008] (CPF_Edit)
	uint32_t                                           bJumped : 1;                                   // 0x001C (0x0004) [0x0000000000000000] [0x00000010] 
	uint32_t                                           bGrab : 1;                                     // 0x001C (0x0004) [0x0001000000000000] [0x00000020] 
	uint32_t                                           bButtonMash : 1;                               // 0x001C (0x0004) [0x0001000000000000] [0x00000040] 
};

// ScriptStruct TAGame._Types_TA.ProductAttributesArray
// 0x0010
struct FProductAttributesArray
{
	TArray<class UProductAttribute_TA*>                Attributes;                                    // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.LoadoutAttributesArray
// 0x0010
struct FLoadoutAttributesArray
{
	TArray<struct FProductAttributesArray>             Products;                                      // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.RandomWeight
// 0x0010
struct FRandomWeight
{
	class UObject*                                     Obj;                                           // 0x0000 (0x0008) [0x0000000000000000]               
	float                                              Weight;                                        // 0x0008 (0x0004) [0x0000000000000000]               
	float                                              OrigWeight;                                    // 0x000C (0x0004) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.AssetLoadResult
// 0x0020
struct FAssetLoadResult
{
	int32_t                                            ProductID;                                     // 0x0000 (0x0004) [0x0000000000000000]               
	struct FName                                       AssetName;                                     // 0x0004 (0x0008) [0x0000000000000000]               
	uint8_t                                           UnknownData00[0x4];                               		// 0x000C (0x0004) MISSED OFFSET
	class UProductAsset_TA*                            Asset;                                         // 0x0010 (0x0008) [0x0000000000000000]               
	class UProductThumbnailAsset_TA*                   ThumbnailAsset;                                // 0x0018 (0x0008) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.ProductThumbnailResult
// 0x0018
struct FProductThumbnailResult
{
	class UProductAsset_TA*                            Asset;                                         // 0x0000 (0x0008) [0x0000000000000000]               
	class UOnlineProduct_TA*                           OnlineProduct;                                 // 0x0008 (0x0008) [0x0000000000000000]               
	class UProductThumbnail_TA*                        Thumbnail;                                     // 0x0010 (0x0008) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.MapImageLoadResult
// 0x0010
struct FMapImageLoadResult
{
	class UTexture2D*                                  Image;                                         // 0x0000 (0x0008) [0x0000000000000000]               
	struct FName                                       MapName;                                       // 0x0008 (0x0008) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.ClientLoadoutData
// 0x0010
struct FClientLoadoutData
{
	TArray<int32_t>                                    Products;                                      // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.LoadoutTeamColor
// 0x0008
struct FLoadoutTeamColor
{
	uint8_t                                            Team;                                          // 0x0000 (0x0001) [0x0000000000000000]               
	uint8_t                                            TeamColorID;                                   // 0x0001 (0x0001) [0x0000000000000000]               
	uint8_t                                            CustomColorID;                                 // 0x0002 (0x0001) [0x0000000000000000]               
	uint8_t                                           UnknownData00[0x1];                               		// 0x0003 (0x0001) MISSED OFFSET
	uint32_t                                           bSet : 1;                                      // 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct TAGame._Types_TA.LoadoutTeamPaint
// 0x0008 (0x0008 - 0x0010)
struct FLoadoutTeamPaint : FLoadoutTeamColor
{
	int32_t                                            TeamFinishID;                                  // 0x0008 (0x0004) [0x0000000000000000]               
	int32_t                                            CustomFinishID;                                // 0x000C (0x0004) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.LoadoutData
// 0x0030 (0x0010 - 0x0040)
struct FLoadoutData : FClientLoadoutData
{
	struct FLoadoutTeamPaint                           TeamPaint;                                     // 0x0010 (0x0010) [0x0000000000000000]               
	struct FName                                       Title;                                         // 0x0020 (0x0008) [0x0000000000000000]               
	int32_t                                            TeamIndex;                                     // 0x0028 (0x0004) [0x0000000000000000]               
	uint8_t                                           UnknownData00[0x4];                               		// 0x002C (0x0004) MISSED OFFSET
	TArray<struct FProductInstanceID>                  OnlineProducts;                                // 0x0030 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.ClientLoadoutOnlineProduct
// 0x0010
struct FClientLoadoutOnlineProduct
{
	TArray<class UProductAttribute_TA*>                Attributes;                                    // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.ClientLoadoutOnlineData
// 0x0010
struct FClientLoadoutOnlineData
{
	TArray<struct FClientLoadoutOnlineProduct>         Products;                                      // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.InputRate
// 0x0008
struct FInputRate
{
	float                                              RiseRate;                                      // 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              FallRate;                                      // 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct TAGame._Types_TA.TurningCircle
// 0x0010
struct FTurningCircle
{
	struct FVector                                     Center;                                        // 0x0000 (0x000C) [0x0000000000000000]               
	float                                              Radius;                                        // 0x000C (0x0004) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.StatValue
// 0x0014
struct FStatValue
{
	struct FName                                       Id;                                            // 0x0000 (0x0008) [0x0000000000000000]               
	int32_t                                            Values[0x3];                                   // 0x0008 (0x000C) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.DemolishDataGoalExplosion
// 0x0008 (0x0028 - 0x0030)
struct FDemolishDataGoalExplosion : FDemolishData
{
	class APRI_TA*                                     GoalExplosionOwner;                            // 0x0028 (0x0008) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.VoiceRoomTokenRequest
// 0x0020
struct FVoiceRoomTokenRequest
{
	class FString                                      RoomId;                                        // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<struct FUniqueNetId>                        PlayerIds;                                     // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.PlayerIdArray
// 0x0010
struct FPlayerIdArray
{
	TArray<struct FUniqueNetId>                        Players;                                       // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.ProductWithSettings
// 0x0018
struct FProductWithSettings
{
	class UProductAsset_TA*                            Product;                                       // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UProductPaint_TA*                            Paint;                                         // 0x0008 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UDataAsset_ESportsTeam_TA*                   ESportsTeam;                                   // 0x0010 (0x0008) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct TAGame._Types_TA.ProductTradeInFilter
// 0x0040
struct FProductTradeInFilter
{
	int32_t                                            Id;                                            // 0x0000 (0x0004) [0x0000000000000000]               
	uint8_t                                           UnknownData00[0x4];                               		// 0x0004 (0x0004) MISSED OFFSET
	class FString                                      Label;                                         // 0x0008 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<int32_t>                                    SeriesIDs;                                     // 0x0018 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	uint32_t                                           bBlueprint : 1;                                // 0x0028 (0x0004) [0x0000000000000000] [0x00000001] 
	uint8_t                                           UnknownData01[0x4];                               		// 0x002C (0x0004) MISSED OFFSET
	TArray<uint8_t>                                    TradeInQualities;                              // 0x0030 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.ColorOverride
// 0x0014
struct FColorOverride
{
	uint32_t                                           bOverride : 1;                                 // 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FLinearColor                                Color;                                         // 0x0004 (0x0010) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.TeamColor
// 0x0020
struct FTeamColor
{
	struct FLinearColor                                FontColor;                                     // 0x0000 (0x0010) [0x0000000000000000]               
	TArray<struct FLinearColor>                        Colors;                                        // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.MapSkillSettings
// 0x000C
struct FMapSkillSettings
{
	struct FName                                       MapName;                                       // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	float                                              MinimumSkill;                                  // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct TAGame._Types_TA.MaterialTextureParam
// 0x0010
struct FMaterialTextureParam
{
	struct FName                                       Name;                                          // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UTexture*                                    Value;                                         // 0x0008 (0x0008) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct TAGame._Types_TA.MaterialVectorParam
// 0x0018
struct FMaterialVectorParam
{
	struct FName                                       Name;                                          // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	struct FLinearColor                                Value;                                         // 0x0008 (0x0010) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct TAGame._Types_TA.MaterialScalarParam
// 0x000C
struct FMaterialScalarParam
{
	struct FName                                       Name;                                          // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	float                                              Value;                                         // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct TAGame._Types_TA.MaterialParams
// 0x0030
struct FMaterialParams
{
	TArray<struct FMaterialTextureParam>               TextureParameters;                             // 0x0000 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	TArray<struct FMaterialVectorParam>                VectorParameters;                              // 0x0010 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	TArray<struct FMaterialScalarParam>                ScalarParameters;                              // 0x0020 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.AssociativeMaterialParams
// 0x0038
struct FAssociativeMaterialParams
{
	class UMaterialInterface*                          Material;                                      // 0x0000 (0x0008) [0x0000000000020001] (CPF_Edit | CPF_EditConst)
	struct FMaterialParams                             Params;                                        // 0x0008 (0x0030) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.SkinBodySettings
// 0x0048
struct FSkinBodySettings
{
	class UProductAssetReferenceBody_TA*               Body;                                          // 0x0000 (0x0008) [0x0000000004000001] (CPF_Edit | CPF_EditInline)
	struct FMaterialParams                             Parameters;                                    // 0x0008 (0x0030) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	TArray<struct FAssociativeMaterialParams>          AdditionalBodyParameters;                      // 0x0038 (0x0010) [0x0000000000400041] (CPF_Edit | CPF_EditConstArray | CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.UniqueNetIdGroup4
// 0x0120
struct FUniqueNetIdGroup4
{
	struct FUniqueNetId                                PlayerIds[0x4];                                // 0x0000 (0x0120) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.CurrencyProductData
// 0x0010
struct U_Types_TA_FCurrencyProductData
{
	class UProduct_TA*                                 Product;                                       // 0x0000 (0x0008) [0x0000000000000000]               
	class UOnlineProduct_TA*                           OnlineProduct;                                 // 0x0008 (0x0008) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.Currency
// 0x0060
struct FCurrency
{
	uint8_t                                            Type;                                          // 0x0000 (0x0001) [0x0000000000000000]               
	uint8_t                                           UnknownData00[0x3];                               		// 0x0001 (0x0003) MISSED OFFSET
	struct FName                                       Name;                                          // 0x0004 (0x0008) [0x0000000000000000]               
	uint32_t                                           bCanBeTraded : 1;                              // 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	int32_t                                            TradeHold;                                     // 0x0010 (0x0004) [0x0000000000000000]               
	uint8_t                                           UnknownData01[0x4];                               		// 0x0014 (0x0004) MISSED OFFSET
	struct U_Types_TA_FCurrencyProductData             ProductData;                                   // 0x0018 (0x0010) [0x0000000000000000]               
	int32_t                                            CurrencyID;                                    // 0x0028 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	int32_t                                            Id;                                            // 0x002C (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	int32_t                                            Amount;                                        // 0x0030 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	uint8_t                                           UnknownData02[0x4];                               		// 0x0034 (0x0004) MISSED OFFSET
	class UTexture*                                    LargeImage;                                    // 0x0038 (0x0008) [0x0000000040000000] (CPF_EditInlineNotify)
	class UTexture*                                    SmallImage;                                    // 0x0040 (0x0008) [0x0000000040000000] (CPF_EditInlineNotify)
	class FString                                      LocalizedName;                                 // 0x0048 (0x0010) [0x0000000040400000] (CPF_NeedCtorLink | CPF_EditInlineNotify)
	uint64_t                                           UpdatedTimestamp;                              // 0x0058 (0x0008) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.OnlineXPModifier
// 0x0038
struct FOnlineXPModifier
{
	struct FName                                       Name;                                          // 0x0000 (0x0008) [0x0000000040000000] (CPF_EditInlineNotify)
	float                                              Modifier;                                      // 0x0008 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	uint8_t                                            ModifierType;                                  // 0x000C (0x0001) [0x0000000040000000] (CPF_EditInlineNotify)
	uint8_t                                           UnknownData00[0x3];                               		// 0x000D (0x0003) MISSED OFFSET
	int32_t                                            Value;                                         // 0x0010 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	uint8_t                                           UnknownData01[0x4];                               		// 0x0014 (0x0004) MISSED OFFSET
	class FString                                      LocalizedText;                                 // 0x0018 (0x0010) [0x0000000040400000] (CPF_NeedCtorLink | CPF_EditInlineNotify)
	uint32_t                                           bPremium : 1;                                  // 0x0028 (0x0004) [0x0000000040000000] [0x00000001] (CPF_EditInlineNotify)
	uint32_t                                           bPenalty : 1;                                  // 0x0028 (0x0004) [0x0000000040000000] [0x00000002] (CPF_EditInlineNotify)
	uint32_t                                           bPromo : 1;                                    // 0x0028 (0x0004) [0x0000000040000000] [0x00000004] (CPF_EditInlineNotify)
	int32_t                                            Remaining;                                     // 0x002C (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	int32_t                                            Count;                                         // 0x0030 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	int32_t                                            MaxCount;                                      // 0x0034 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
};

// ScriptStruct TAGame._Types_TA.OnlineXPReward
// 0x0040
struct FOnlineXPReward
{
	struct FName                                       RewardName;                                    // 0x0000 (0x0008) [0x0000000000000000]               
	float                                              Total;                                         // 0x0008 (0x0004) [0x0000000000000000]               
	int32_t                                            Base;                                          // 0x000C (0x0004) [0x0000000000000000]               
	int32_t                                            BaseLevel;                                     // 0x0010 (0x0004) [0x0000000000000000]               
	int32_t                                            Level;                                         // 0x0014 (0x0004) [0x0000000000000000]               
	int32_t                                            CapAdjustment;                                 // 0x0018 (0x0004) [0x0000000000000000]               
	uint8_t                                           UnknownData00[0x4];                               		// 0x001C (0x0004) MISSED OFFSET
	TArray<int32_t>                                    LevelThresholds;                               // 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<struct FOnlineXPModifier>                   RewardModifiers;                               // 0x0030 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.OnlineProductDrop
// 0x0078
struct FOnlineProductDrop
{
	struct FUniqueNetId                                PlayerID;                                      // 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<struct FOnlineProductData>                  ProductData;                                   // 0x0048 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<struct FCurrency>                           CurrencyData;                                  // 0x0058 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<struct FOnlineXPReward>                     RewardDrops;                                   // 0x0068 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.ChallengeRequirementProgress
// 0x0008
struct FChallengeRequirementProgress
{
	int32_t                                            ProgressCount;                                 // 0x0000 (0x0004) [0x0000000000000000]               
	int32_t                                            ProgressChange;                                // 0x0004 (0x0004) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.ChallengeProgress
// 0x0028
struct FChallengeProgress
{
	int32_t                                            Id;                                            // 0x0000 (0x0004) [0x0000000000000000]               
	uint32_t                                           bIsHidden : 1;                                 // 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	int32_t                                            CompleteCount;                                 // 0x0008 (0x0004) [0x0000000000000000]               
	uint32_t                                           bNotifyCompleted : 1;                          // 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bNotifyAvailable : 1;                          // 0x000C (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           bNotifyNewInfo : 1;                            // 0x000C (0x0004) [0x0000000000000000] [0x00000004] 
	uint32_t                                           bRewardsAvailable : 1;                         // 0x000C (0x0004) [0x0000000000000000] [0x00000008] 
	uint32_t                                           bComplete : 1;                                 // 0x000C (0x0004) [0x0000000000000000] [0x00000010] 
	uint64_t                                           ProgressResetTimeUTC;                          // 0x0010 (0x0008) [0x0000000000000000]               
	TArray<struct FChallengeRequirementProgress>       RequirementProgress;                           // 0x0018 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.GarageSlotCost
// 0x0008
struct FGarageSlotCost
{
	int32_t                                            Id;                                            // 0x0000 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	int32_t                                            Amount;                                        // 0x0004 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
};

// ScriptStruct TAGame._Types_TA.ProductDrop
// 0x0024
struct FProductDrop
{
	struct FProductHashID                              GroupId;                                       // 0x0000 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	uint8_t                                           UnknownData00[0x4];                               		// 0x0004 (0x0004) MISSED OFFSET
	struct FProductInstanceID                          DropID;                                        // 0x0008 (0x0010) [0x0000000040000000] (CPF_EditInlineNotify)
	uint64_t                                           DropTime;                                      // 0x0018 (0x0008) [0x0000000040000000] (CPF_EditInlineNotify)
	uint32_t                                           bCanEquipNow : 1;                              // 0x0020 (0x0004) [0x0000000040000000] [0x00000001] (CPF_EditInlineNotify)
};

// ScriptStruct TAGame._Types_TA.RPCIntroCar
// 0x0038
struct FRPCIntroCar
{
	int32_t                                            TemplateIndex;                                 // 0x0000 (0x0004) [0x0000000000000000]               
	uint8_t                                           UnknownData00[0x4];                               		// 0x0004 (0x0004) MISSED OFFSET
	class FString                                      TemplateName;                                  // 0x0008 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      TemplateDescription;                           // 0x0018 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<int32_t>                                    ProductsList;                                  // 0x0028 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.IntroCarInfo
// 0x0028
struct FIntroCarInfo
{
	int32_t                                            TemplateIndex;                                 // 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint8_t                                           UnknownData00[0x4];                               		// 0x0004 (0x0004) MISSED OFFSET
	class FString                                      TemplateName;                                  // 0x0008 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class FString                                      TemplateDescription;                           // 0x0018 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.EditorIntroCar
// 0x0038
struct FEditorIntroCar
{
	struct FIntroCarInfo                               Info;                                          // 0x0000 (0x0028) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	TArray<class UProduct_TA*>                         ProductList;                                   // 0x0028 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.AppliedBreakoutDamage
// 0x0018
struct FAppliedBreakoutDamage
{
	uint8_t                                            Id;                                            // 0x0000 (0x0001) [0x0000000000000000]               
	uint8_t                                           UnknownData00[0x3];                               		// 0x0001 (0x0003) MISSED OFFSET
	struct FVector                                     Location;                                      // 0x0004 (0x000C) [0x0000000000000000]               
	int32_t                                            DamageIndex;                                   // 0x0010 (0x0004) [0x0000000000000000]               
	int32_t                                            TotalDamage;                                   // 0x0014 (0x0004) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.PaintAttributeParameter
// 0x0010
struct FPaintAttributeParameter
{
	uint8_t                                            PaintVariant;                                  // 0x0000 (0x0001) [0x0000000000000001] (CPF_Edit)    
	uint8_t                                           UnknownData00[0x3];                               		// 0x0001 (0x0003) MISSED OFFSET
	struct FName                                       ParameterName;                                 // 0x0004 (0x0008) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bEnabled : 1;                                  // 0x000C (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	uint32_t                                           bGammaCorrect : 1;                             // 0x000C (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
};

// ScriptStruct TAGame._Types_TA.ProductLevelData
// 0x0010
struct FProductLevelData
{
	int32_t                                            Level;                                         // 0x0000 (0x0004) [0x0000000040000001] (CPF_Edit | CPF_EditInlineNotify)
	int32_t                                            SoftCurrency;                                  // 0x0004 (0x0004) [0x0000000040000001] (CPF_Edit | CPF_EditInlineNotify)
